[
    {
        "id": 1,
        "title": "Avalanche (AVAX)",
        "url": "o-que-e-avalanche-avax",
        "contentTitle": "O que é Avalanche (AVAX)?",
        "content": ["<h2 class='article-header'>Introdução</h2><p class='article-text'>Avalanche busca melhorar a escalabilidade mantendo sua velocidade e descentralização. É formada por 3 <a href='/academia/glossario/blockchain' >blockchains</a>: Exchange Chain (X-Chain), Contract Chain (C-Chain) e Platform Chain (P-Chain)cada uma tendo sua própria usabilidade tornando a rede efetivamente mais rápida, falaremos mais sobre isso ao longo do artigo.<br><br></p><p class='article-text'>Outro ponto chave é seu <a href='/academia/glossario/protocolo' >protocolo</a> Avalanche Consensus, um método de validação que busca ser rápido e viável aumentando assim a <a href='/academia/glossario/descentralizado'> descentralização</a> da rede, e com as suas Subnets escalando de forma horizontal permite a criação de diversas blockchain interoperáveis. Por não possuir limite de Subnets, torna-se uma rede com potencial próximo ao infinito. <br><br></p><p class='article-text'>Avalanche afirma possuir a rede mais rápida do mercado de <a href='/academia/glossario/blockchain'> blockchains</a>e buscar unir escalabilidade e descentralização com baixas taxas de rede.</p>", 
        
        "<h2 class='article-header'>Lançamento</h2><p class='article-text'>Avalanche foi lançada em setembro de 2020 pela Ava Labs, um time de NY, EUA.Em seu lançamento Ava Labs arrecadou aproximadamente U$300 milhões em fundos,e com as a vendas públicas e privadas de seus <a href='/academia/glossario/tokens' >tokens</a> (AVAX) a Avalanche Foundation adquiriuU$48 milhões. O time de fundadores por trás da Ava Labs consiste em três pessoas, Kevin Sekniqi, Maofan 'Ted' Yin e Emin Gün Sirer</p>", 
        
        "<h2 class='article-header'>Quais problemas a Avalanche soluciona?</h2><p class='article-text'>Avalanche busca solucionar 3 problemas principais:</p><ul><li><strong> - Escalabilidade</strong></li><li><strong> - Taxas de transações</strong></li><li><strong> - Interoperabilidade</strong></li></ul>", 
        
        "<h2 class='article-header'>Escalabilidade e Descentralização</h2><p class='article-text'><a href='/academia/glossario/blockchain' >Blockchains</a> tradicionalmente enfrentam problemas em balancear escalabilidade e descentralização. Uma rede com sua atividade crescente pode congestionar rapidamente trazendo atrasos em suas transações. <a href='/academia/glossario/bitcoin' >Bitcoin (BTC)</a> é um bom exemplo,já que as transações podem levar horas ou até dias para serem processadas em períodos de congestionamento na rede. </p><br><p class='article-text'>Uma forma de combater isso é transformar a rede mais <a href='/academia/glossario/centralizado'>centralizada</a>, oferecendo a poucas pessoas a autoridade de validar as atividades da rede, gerando uma maior velocidade. Contudo, decentralização é fundamental para a segurança de uma <a href='/academia/glossario/blockchain' >blockchain</a>. Novas tecnologias vêm surgindo para solucionar esse problema, e a Avalanche desenvolveu a sua própria, falaremos disso mais tarde.</p>", "<h2 class='article-header'>Taxas Elevadas</h2><p class='article-text'>Outro problema comum em grandes Blockchains como a <a href='/academia/descubra/o-que-e-ethereum-eth' >Ethereum</a> são as taxas de <a href='/academia/glossario/gas' >gas</a>, que podem ficar elevadas com o congestionamento. Isso definitivamente desencoraja os usuários dessas Blockchains, mas as Blockchains alternativas possuem ecossistemas menos estabelecidos. A popularidade da Ethereum e suas poucas alternativas, o levaram a ter tráfego e taxas elevadas. Em momentos de congestionamento é possível ver transferências simples custando mais de U$10 e interações mais complexas passando a casa dos U$100.</p>", 

        "<h2 class='article-header'>Interoperabilidade</h2><p class='article-text'>Diferentes projetos e negócios possuem suas próprias necessidades com relação a <a href='/academia/glossario/blockchain' >Blockchain</a>. Antigamente projetos deveriam trabalhar juntamente ou com a <a href='/academia/descubra/o-que-e-ethereum-eth' >Ethereum</a>, outra blockchain individual não relacionada ás suas necessidades, ou com blockchains privadas. Mas encontrar equilíbrio entre customização e cooperação entre múltiplas blockchains é de fato desafiador. Avalanche busca solucionar esse problema com Subnets -  Blockchain customizadas especificas de cada aplicação que compartilham da segurança, velocidade e compatibilidade da sua rede primária.</p>", 
        
        "<h2 class='article-header'>Como a Avalanche funciona?</h2><p class='article-text'>Avalanche utiliza uma combinação de métodos que a torna única e é formada atualmente por três blockchains primárias interoperáveis, a  X-Chain, C-Chain, e P-Chain. </p><br><p class='article-text'><strong>1.  X-Chain (The Exchange Chain) </strong> é usada para criar e trocar os token <a href='/academia/descubra/o-que-e-avalanche-avax' >AVAX</a> e outros ativos digitais. As taxas de transações são pagas em AVAX e a Blockchain usa o protocolo Avalanche Consensus.</p><br><p class='article-text'><strong> 2.  C-Chain (The Contract Chain) </strong> é onde os desenvolvedores criam <a href='/academia/glossario/smart-contracts' >contratos inteligentes</a> e DApps. Essa rede implementa uma instancia da <a href='/academia/glossario/ethereum-virtual-machine-evm' >Ethereum Virtual Machine (EVM)</a> habilitando <a href='/academia/glossario/aplicacao-descentralizada-dapp' >DApps</a> compatíveis com a EVM. Utiliza de uma versão modificada do <a href='/academia/glossario/protocolo' >protocolo</a> Avalanche Consensus chamada de Snowman.</p><br><p class='article-text'><strong> 3.  P-Chain (The Platform Chain)</strong> Coordena <a href='/academia/glossario/validador' >validadores</a> da rede, analisa as Subnets ativas e permite a criação de novas Subnets. A P-Chain também usa o Protocolo Snowman.</p><br><p class='article-text'> Com cada <a href='/academia/glossario/blockchain' >Blockchain</a> tendo uma função diferente, Avalanche melhora a velocidade e escalabilidade comparado a rodar todos os processos em uma única Blockchain.  Os desenvolvedores da Avalanche adaptaram mecanismos de <a href='/academia/glossario/consenso' >consenso</a> para a necessidade de cada Blockchain, e os usuários precisam de AVAX para fazer o <a href='/academia/glossario/staking' >stake</a> e pagar as taxas da rede, oferecendo ao ecossistema uma moeda de uso comum.</p>", 
        
        "<h2 class='article-header'>Como funcionam os mecanismos de consenso da Avalanche?</h2><p class='article-text'>Ambos <a href='/academia/glossario/protocolo' >protocolos</a> de consenso da Avalanche possuem similaridades. Esse sistema duplo é o motivo principal para a alta velocidade e escalabilidade da rede.</p><h2 class='article-header'>Avalanche Consensus</h2><p class='article-text'>O protocolo Avalanche Consensus não precisa de um “líder” para chegar ao consenso como na <a href='/academia/glossario/proof-of-work-pow' >Proof of Work (PoW)</a>, <a href='/academia/glossario/proof-of-stake-pos' >Proof of Stake (PoS)</a> ou <a href='/academia/glossario/delegated-proof-of-stake-dpos' >Delegated Proof of Stake (DPoS)</a>. Esse fator aumenta a descentralização na rede da Avalanche sem sacrificar sua escalabilidade. Em contrapartida PoW, PoS e DPoS acabam tendo um “líder” que atua processando as transações, cujo trabalho é então validado pelos outros.</p> <br><p class='article-text'>Avalanche implementa um <a href='/academia/glossario/directed-acyclic-graph-dag' >Directed Acyclic Graph (DAG)</a> juntamente com seu protocolo de consenso otimizado. Um DAG permite que a rede processe transações paralelas. Os <a href='/academia/glossario/validador' >validadores</a> analisam uma amostra de outros validadores para determinar se um nova transação é valida, e após um certo número de repetições desse processo aleatório de amostras validadas, a estatística mostra que seria impossível tal transação ser falsa.</p><br><p class='article-text'>Todas as transações são finalizadas imediatamente sem confirmações adicionais serem necessárias. Rodar um <a href='/academia/glossario/node' >node</a> de validação e validar transações na Avalanche requerem pouco uso de hardware sendo assim acessível, melhorando sua desempenho e descentralização.</p>", 
        
        "<h2 class='article-header'>Snowman</h2><p class='article-text'>O Segundo <a href='/academia/glossario/protocolo' >protocolo</a> presente na rede da Avalanche o protocolo de consenso Snowman, também realiza a validação pelo consenso porém ordena as transações linearmente. Ou seja, diferente do protocolo Avalanche Consensus (que utiliza DAG), Snowman cria blocos. </p> <br><h2 class='article-header'>AVAX Token</h2><p class='article-text'>AVAX é o token nativo da rede avalanche com um <a href='/academia/glossario/max-supply' >Max Supply</a> de 720 milhões. As transferências na rede são pagas utilizando AVAX e todas as <a href='/academia/glossario/taxa-de-transacao' >taxas de transação</a> são queimadas como um mecanismo deflacionário. </p> <br><p class='article-text'><span class='detailSpan'>>></span> <strong>AVAX Possui três usos principais:</strong>  <span class='detailSpan'> &lt&lt </span> <br><br></p><p class='article-text'><strong>1.  Staking -</strong> é possível realizar o <a href='/academia/glossario/staking' >Stake</a> de AVAX para tornar-se um <a href='/academia/glossario/validador' >validador</a> ou delegá-lo a um validador. Validadores recebem um adicional referente ao seu valor em stake com um Annual Percentage Yield (APY) próximo a 10%, e define um percentual disso para os delegadores que  o apoiaram.</p><br><p class='article-text'><strong>2.  Interoperabilidade -</strong> AVAX é utilizado como uma unidade comum para todas as Subnets da rede, melhorando assim a interoperabilidade entre elas.</p><br><p class='article-text'><strong>3.  Taxas -</strong> AVAX é a moeda principal da rede sendo utilizada para pagar as taxas de transação e inscrições nas Subnets.</p>", 
        
        "<h2 class='article-header'>Stake de AVAX</h2><p class='article-text'>Holders de AVAX podem ganhar recompensas tornando-se um validador ou realizando o <a href='/academia/glossario/staking' >staking</a> com validadores já existentes. Para tornar-se um validador é necessário ter em Stake 2.000 <a href='/academia/descubra/o-que-e-avalanche-avax' >AVAX</a>. </p> <br><p class='article-text'>Por sua rede otimizada, o poder computacional necessário para ser um <a href='/academia/glossario/validador' >validador</a> é baixo e as maiorias dos computadores são capazes de validar as transações.</p>", "<h2 class='article-header'>Como a rede da Avalanche se difere de outras redes com alta escalabilidade?</h2><p class='article-text'><strong> Avalanche compete com outras redes de alta escalabilidade como a Ethereum, <a class='articleLink' href='/academia/descubra/o-que-e-polygon-matic'>Polygon</a> e <a class='articleLink' href='/academia/descubra/o-que-e-solana-sol' >Solana</a> mas o que a torna tão única de suas alternativas?</strong></p>",
        
        "<h2 class='article-header'>Mecanismos de Consenso</h2><p class='article-text'>O principal diferencial é seu <a href='/academia/glossario/protocolo' >protocolo</a> Avalanche Consensus, que permite transações em alta velocidade. Mas a Avalanche não é a única a possuir um mecanismo de validação pelo consenso. <a href='/academia/descubra/o-que-e-solana-sol' >Solana</a> possui Proof of History que pode lidar com mais de 50.000 <a href='/academia/glossario/transacoes-por-segundo-tps' >Transações por Segundo (TPS)</a>superando as 6.500 TPS que a Avalanche afirma ser capaz. Porém não se dever analisar somente A TPS para identificar a velocidade de uma rede.</p>", 
        
        "<h2 class='article-header'>Velocidade da rede e finalização</h2><p class='article-text'>Outro diferencial da Avalanche é seu tempo de finalização. Menor que 1 segundo. O que isso significa? E como isso a torna uma rede mais rápida? Após realizar uma transação é preciso garantir que foi realizada e que não pode ser revertido ou alterada, e esse processo pode ter um atraso em outras <a href='/academia/glossario/blockchain' >Blockchains</a>. Pode-se ter 150.00 <a href='/academia/glossario/transacoes-por-segundo-tps' >TPS</a> mas se tiver um atraso na finalização a rede ainda assim será lenta. Avalanche utiliza disso ao seu poder, e afirma ter o tempo de finalização mais rápido do mercado.</p>",
        
        "<h2 class='article-header'>Descentralização</h2><p class='article-text'>Um dos principais focos da Avalanche é a <a href='/academia/glossario/descentralizado' >descentralização</a>. E levando em consideração o tamanho, possui um grande número de <a href='/academia/glossario/validador' >validadores</a> ativos, (mais de 1300 em abril de 2022) possivelmente pelo fato de necessitar de baixo poder computacional para tornar-se validador. Entretanto, com o preço da <a href='/academia/descubra/o-que-e-avalanche-avax' >AVAX</a> elevado atuar como validador tem se tornado cada vez mais caro.</p>", "<h2 class='article-header'>Interoperabilidade</h2><p class='article-text'>A interoperabilidade da <a href='/academia/glossario/blockchain' >Blockchain</a> da Avalanche é potencialmente ilimitada. Para utilizar de sua rede basta uma simples taxa de inscrição que comparada com outras redes como a <a href='/academia/descubra/o-que-e-polkadot-dot' >Polkadot</a>, na qual oferece de leilões por vagas em sua Parachain, é muito mais versátil e de fácil acesso ao público em geral.</p>", "<h2 class='article-header'>Considerações finais</h2><p class='article-text'>Com as <a href='/academia/glossario/decentralized-finance-defi' >Finanças Descentralizadas</a> em seu ápice e crescendo diariamente, têm se buscado alternativas para redes lentas e com altas taxas, redes como a Avalanche tornaram-se os principais concorrentes da <a href='/academia/descubra/o-que-e-ethereum-eth' >Ethereum</a> devido a sua compatibilidade com a <a href='/academia/glossario/ethereum-virtual-machine-evm' >EVM</a> e taxas de transação baixas. Porém o mercado possui um vasto número de Plataformas <a href='/academia/glossario/decentralized-finance-defi' >DeFi</a> com alta velocidade e escalabilidade.</p><br><p class='article-text'>Avalanche tem se destacado e crescido desde seu lançamento, e já está em um nível de comparar-se a <a href='/academia/descubra/o-que-e-ethereum-eth' >Ethereum</a> em transações diárias, agora devemos esperar para ver se poderá se comparar com outras <a href='/academia/glossario/blockchain' >blockchains</a> de alta escalabilidade como a  <a class='articleLink' href='/academia/descubra/o-que-e-solana-sol' >Solana</a>e a <a class='articleLink' href='/academia/descubra/o-que-e-polygon-matic' >Polygon</a>.</p>"],
        "categories": ["blockchain"],
        "image": "AVAXLogo.png",
        "date": "22/05/2022",
        "readTime": 8,
        "mainColor": "#dc2626",
        "secondaryColor": "#fee2e2"
    },
    {
        "id": 2,
        "title": "Cardano (ADA)",
        "url": "o-que-e-cardano-ada",
        "contentTitle": "O que é Cardano (ADA)?",
        "content": ["<p class='article-text'><strong>Cardano é uma Blockchain Proof of Stake de terceira geração que busca solucionar os problemas de escalabilidade das Blockchains de segunda geração como a Ethereum.</strong></p><br><p class='article-text'><strong>O desenvolvimento da Cardano é caracterizado por diversos estudos acadêmicos e filosofias científicas, além de possuir toda sua imagem voltada a pessoas e personagens históricos, o que fez receber grande apoio da comunidade.</strong></p><br><p class='article-text'><strong>Com o lançamento da fase Goguen, Cardano está se direcionando para alcançar seus objetivos para poder competir com redes de grande tráfego.</strong></p>",

        "<h2 class='article-header'>Introdução</h2><p class='article-text'>Desde seu lançamento em 2015, o projeto Cardano juntamente com sua <a href='/academia/glossario/criptomoedas' >criptomoeda</a> ADA, teve grande popularidade entre a comunidade cripto. Os preceitos acadêmicos aplicados em seu desenvolvimento a tornam única e atraem olhares daqueles que estudam a fundo o projeto.</p><br><p class='article-text'>O projeto Cardano tem como principal time de desenvolvimento a empresa de tecnologia fundada por Charles Hoskinson, IOHK (Input Output Hong Kong). Essa não é a primeira vez que Hoskinson trabalha com criptomoedas, em 2013, Charles era do time da <a href='/academia/descubra/o-que-e-ethereum-eth' >Ethereum</a>, projeto que hoje se tornou a principal concorrente da Cardano.</p><br><p class='article-text'>Mas afinal o que é a Cardano? Quais suas funcionalidades? E como funciona o seu complexo <a href='/academia/glossario/roadmap' >Roadmap</a>? Vamos descobrir.</p>",

        "<h2 class='article-header'>O que é Cardano (ADA)?</h2><p class='article-text'>Cardano é um Blockchain para usos gerais desenhada sob fundamentos de pesquisas acadêmicas. Seu desenvolvimento é composto por times profissionais de engenheiros, matemáticos e cientistas, e segundo os criadores da Cardano, os princípios básicos do projeto é apresentar uma rede Blockchain que possua segurança, <a href='/academia/glossario/escalabilidade' >escalabilidade</a>  e <a href='/academia/glossario/interoperabilidade' >interoperabilidade</a>.</p><br><p class='article-text'>O <a href='/academia/glossario/tokens' >token</a> nativo da rede, ADA, é usado para realizar operações na rede como se fosse o combustível para mantê-la ativa, sua relação com a Cardano é similar à relação que o <a href='/academia/glossario/ether' >Ethere (ETH)</a> tem com a Ethereum.</p><br><p class='article-text'>O desenvolvimento da Cardano é separado em diferentes unidades de trabalho. A IOHK cuida da parte de desenvolvimento do <a href='/academia/glossario/protocolo' >protocolo</a> Cardano, a supervisão do projeto é feita pela Cardano Foundation , e o gerenciamento de negócios e adesão direcionada fica de responsabilidade da empresa EMURGO.</p>",

        "<h2 class='article-header'>O Roadmap da Cardano consiste em 5 fases:</h2><p class='article-text'><ul><li><strong> - Byron:</strong> Fase inicial, caracterizada pelo lançamento da rede Cardano o que possibilitou funcionalidades básicas como a transação de ADA.</li><br><li><strong>- Shelley:</strong> Um <a href='/academia/glossario/hard-fork' >hard fork</a> focado na descentralização da rede, nessa fase <a href='/academia/glossario/node' >nodes</a> passaram a ser operados pela comunidade, e pools de <a href='/academia/glossario/staking' >Staking</a> foram criada por holders de ADA.</li><br><li><strong> - Goguen:</strong> Fase que possibilita a criação e execução de <a href='/academia/glossario/smart-contracts' >Smart Contracts</a> na rede da Cardano, permitindo que desenvolvedores criem plataformas <a href='/academia/glossario/decentralized-finance-defi' >DeFi</a> e <a href='/academia/glossario/aplicacao-descentralizada-dapp' >Aplicações Descentralizadas (DApps)</a>.</li><br><li><strong> - Basho:</strong> Fase focada para otimização da rede, aumento na escalabilidade e interoperabilidade.</li><br><li><strong> - Voltaire:</strong> Na fase Voltaire, um sistema de tesouraria será criado implementado para a adesão de governança.</li></ul></p><br>",

        "<h2 class='article-header'>Como a Cardano funciona?</h2><p class='article-text'>Tanto as <a href='/academia/glossario/blockchain' >Blockchains</a> de primeira geração (<a href='/academia/glossario/bitcoin' >Bitcoin</a>) quanto de segunda geração (<a href='/academia/descubra/o-que-e-ethereum-eth' >Ethereum</a>) sofrem com o problema de escalabilidade. Cardano é vista como uma blockchain de “terceira geração” que busca atuar diretamente para a solução desse problema.</p><br><p class='article-text'>Blockchains de gerações passadas passam dificuldades com a <a href='/academia/glossario/escalabilidade' >escalabilidade</a>, devido a quantidade de transações que a rede suporta, isso as torna ineficiente para uma adesão global. Podemos ver como exemplo o BTC e a ETH, que por vezes possuem altas <a href='/academia/glossario/taxa-de-transacao' >taxas de transação</a> e tempos elevados de confirmação.</p><br><p class='article-text'>Cardano busca superá-las em número de transações suportadas utilizando vários métodos. Um deles e talvez o mais significante, é seu mecanismo próprio de consenso através de <a href='/academia/glossario/proof-of-stake-pos' >Proof of Stake (PoS)</a>, chamado Ouroboros.</p><br><p class='article-text'>Cardano já pensa na escalabilidade de sua rede para o futuro, e com isso desenvolveu uma <a href='/academia/glossario/solucoes-de-segunda-camada' >solução de segunda camada</a> chamada Hydra. Ainda não existem grandes utilidades para esse mecanismo mas com o crescimento da rede, a Hydra (Que recebe esse nome devido a criatura mitológica de mesmo nome) vai estar lá para apoiá-los.</p>",
        
        "<h2 class='article-header'>O que é o token ADA?</h2><p class='article-text'>Cardano nomeou sua moeda nativa da rede em homenagem à Ada Lovelace, a matemática que criou o primeiro <a href='/academia/glossario/algoritmo' >algoritmo</a> a ser processado por uma máquina no século 19.</p><br><p class='article-text'>A distribuição de ADA foi feita em um processo de <a href='/academia/glossario/initial-coin-offering-ico' >ICO</a> ICO, na qual 57,6% foram distribuídos a um preço inicial de U$0.0024 por Token. ADA teve uma grande valorização desde seu lançamento, alcançando a marca de U$3,00 por unidade em sua <a href='/academia/glossario/alta-historica-ath' >alta histórica (ATH)</a>.</p><br><p class='article-text'>ADA é utilizada como <a href='/academia/glossario/token-de-utilidade' >token de utilidade</a> na rede Cardano, servindo como moeda digital para trocar ativos, e pagar taxas de transação (Similar ao Ether na Ethereum). ADA também serve como token de governança, e seus <a href='/academia/glossario/holder' >holders</a> podem fazer o Staking de ADA para receberem retornos em pools de Stake.</p>",

        "<h2 class='article-header'>Como guardar ADA?</h2><p class='article-text'>A empresa que desenvolve o projeto, IOHK, desenvolveu também uma carteira <a href='/academia/glossario/open-source-software' >open-source</a> para guardar ADA, chamada de Daedalus. Essa carteira serve como um <a href='/academia/glossario/full-node' >Full Node</a> na rede, ou seja, a blockchain completa da Cardano precisa ser baixada para seu funcionamento, e toda transação é verificada, o que traz uma maior segurança.</p><br><p class='article-text'>Existem também carteiras mais simples que não precisam obrigatoriamente da Blockchain completa baixada para funcionar, alguns exemplos são a AdaLite e a Yoroi Wallet. <a href='/academia/glossario/cold-wallet' >Cold Wallet</a> como Trezor e Ledger também são aceitas por todas as carteiras usadas anteriormente como exemplo.</p>",

        "<h2 class='article-header'>Considerações finais</h2><p class='article-text'>Cardano é um projeto ambicioso que deseja criar uma infraestrutura capaz de suportar a adesão global no uso de criptomoedas. E apesar de ter grandes objetivos o desenvolvimento da plataforma vem se tornado cada vez mais lento.</p><br><p class='article-text'>Não tem como saber se as <a href='/academia/glossario/blockchain' >Blockchains</a> de terceira geração irão dominar o mercado, superando as soluções de segunda camada de projetos já consolidados, isso é o que Cardano busca e agora precisamos ficar de olho na forma que a Cardano vai escolher para alcançar esse objetivo.</p>"],
        "categories": ["blockchain"],
        "image": "ADALogo.png",
        "date": "09/06/2022",
        "readTime": 6,
        "mainColor": "#2563eb",
        "secondaryColor": "#dbeafe"
    },
    {
        "id": 3,
        "title": "Chainlink (LINK)",
        "url": "o-que-e-chainlink-link",
        "contentTitle": "O que é Chainlink?",
        "content": ["<p class='article-text'>Chainlink é um dos projetos mais utilizados do universo de criptomoedas. Com seus Oracles descentralizados, Chainlink conecta dados do mundo real com Smart Contracts na Blockchain da Ethereum.</p><br><p class='article-text'>Chainlink junta diversas pessoas empenhadas a fornecer informações confiáveis do mundo externo para o mundo das Blockchains, é como se fosse grupo de pesquisadores que estão sempre buscando a informação mais próxima da verdade, mas por que podemos confiar neles?</p>",
        
        "<h2 class='article-header'>Introdução</h2><p class='article-text'>Smart Contracts, são contratos inteligentes que se executam automaticamente caso certa condição aconteça, facilitando acordos dentro das <a href='/academia/glossario/blockchain'>Blockchains</a>. Porém existem algumas dificuldades.</p><br><p class='article-text'>Blockchains funcionam perfeitamente com informações internas, e com o crescimento dessa tecnologia, trocar informações está cada vez mais rápido e barato. Contudo, não possuem um bom acesso à informações externas, e conectar esses dados <a href='/academia/glossario/off-chain'>Off-chain</a> sempre foi um grande desafio das Blockchains.</p><br><p class='article-text'> Chainlink busca solucionar esse desafio com seus serviços de Oracles <a href='/academia/glossario/descentralizado'>descentralizados</a>, um sistema que é capaz de absorver informações externas, transformá-las em dados que Smart Contracts sejam capazes de ler e executar uma função, e inserir essas informações na Blockchain.</p><br><p class='article-text'><strong>Dados Reais</strong> <span class='detailSpan'>>></span><strong>Oracle</strong> <span class='detailSpan'>>></span><strong>Código de Smart Contract</strong> <span class='detailSpan'>>></span><strong>Blockchain</strong></p>",

        "<h2 class='article-header'>O que é Chainlink?</h2><p class='article-text'>Chainlink é uma rede de Oracles descentralizados que operam sobre redes <a href='/academia/glossario/blockchain'>Blockchain</a> possibilitando que dados reais sejam enviados e executados em <a href='/academia/glossario/smart-contracts'>Smart Contracts</a>. Chainlink utiliza informações de <a href='/academia/glossario/application-programming-interface-api'>APIs</a>, e outros sistemas Off-chain para disponibilizar recursos em seus serviços. O token nativo da rede é o LINK, criado sobre o protocolo <a href='/academia/glossario/erc-20'>ERC-20</a>, é utilizado principalmente para pagar por esses serviços de Oracle.</p><br><p class='article-text'>Os Oracles da Chainlink possuem como diferencial o fator de descentralização, mas nem todos Oracles são assim. Existem também Oracles centralizados, sistemas que utilizam um único centralizador para oferecer informações aos <a href='/academia/glossario/smart-contracts'>Smart Contracts</a>, porém diversos problemas podem acontecer nesse modelo.</p><br><p class='article-text'>Sistemas podem colapsar com informações falsas ou erradas, e caso o centralizador seja mal-intencionado ele é totalmente capaz de alterar as informações em seu próprio benefício. Isso geralmente é citado como “O problema dos Oracles”, e é mais um desafio que a Chainlink busca solucionar.</p><br>",

        "<h2 class='article-header'>Como a Chainlink Funciona?</h2><p class='article-text'>Chainlink usa um sistema de <a href='/academia/glossario/node'>nodes</a> para garantir que os dados enviados aos Smart Contracts sejam os mais confiáveis possíveis.</p><br><p class='article-text'>Quando um Smart Contract faz uma solicitação de dados externos (mundo-real), o <a href='/academia/glossario/protocolo'>protocolo</a> da Chainlink registra esse evento e encaminha aos nodes, que através de um processo de lances são escolhidos para passar ao Smart Contract a informação solicitada.</p><br><p class='article-text'>O ponto forte da Chainlink é a forma como os dados são validados por diferentes fontes. Utilizando um sistema de reputação, o protocolo consegue definir quais fontes são mais confiáveis que outras, com alta assertividade. Isso protege o <a href='/academia/glossario/smart-contracts'>Smart Contract</a> de ataques e aumenta as chances de que as informações passadas sejam verdadeiras.</p>",

        "<h2 class='article-header'>O que é LINK?</h2><p class='article-text'>LINK é o <a href='/academia/glossario/'>token</a> nativo da plataforma, que utiliza o protocolo ERC-667, uma extensão do protocolo ERC-20, protocolo padrão para tokens fungíveis da <a href='/academia/descubra/o-que-e-ethereum-eth'>Ethereum</a>. Mesmo que não possua uma <a href='/academia/glossario/blockchain'>blockchain</a> nativa, LINK existe no ecossistema da Ethereum, e qualquer <a href='/academia/glossario/wallet'>carteira</a> que seja compatível com rede Ethereum pode armazenar LINK.</p><br><p class='article-text'>LINK foi lançado em 2017 com um <a href='/academia/glossario/max-supply'>Max Supply</a> de 1 bilhão de tokens, 35%  desses tokens foram vendidos em seu lançamento num processo de <a href='/academia/glossario/initial-coin-offering-ico'>ICO</a> que arrecadou cerca de 32 milhões de dólares. Outros 30% estão nas mãos dos fundadores do projeto.</p><br><p class='article-text'>Diferente de outras criptomoedas, LINK não cria tokens com o processo de <a href='/academia/glossario/mineracao'>mineração</a> ou <a href='/academia/glossario/staking'>Staking</a>, assim não tendo uma forma de aumentar seu <a href='/academia/glossario/circulating-supply'>Circulating Supply</a>.</p>",

        "<h2 class='article-header'>Como LINK é utilizado?</h2><p class='article-text'>Quando um Smart Contract solicita dados, uma quantidade de LINK é cobrada, e esse valor é então repassado aos nodes em troca de seus serviços. O preço de utilizar dados externos com a Chainlink não é fixo, e varia conforme o tipo de informação necessária.</p><br><p class='article-text'>Para garantir um bom funcionamento da rede no longo-prazo e o comprometimento dos nodes em passar informações verdadeiras, <a href='/academia/glossario/node'>nodes</a> precisam realizar <a href='/academia/glossario/staking'>Staking</a> de seus tokens, que serão recompensados caso trabalhem da forma certa, e punidos caso tente quebrar as regras, perdendo seus LINK em Staking.</p><br><p class='article-text'>Nodes passam por um processo de lances na qual o “vencedor' é selecionado para fornecer a informação solicitada ao <a href='/academia/glossario/smart-contracts'>Smart Contract</a>. E em troca receber a recompensa de seus serviços prestados. Dessa forma, nodes são incentivados a acumular grandes quantidades em <a href='/academia/glossario/staking'>Staking</a>, já que quanto maior o Stake, maior será o contrato que o node irá fornecer informações, resultando em uma maior recompensa.</p>",
        
        "<h2 class='article-header'>Chainlink e DeFi</h2><p class='article-text'>Com o crescimento de protocolos <a href='/academia/glossario/decentralized-finance-defi'>DeFi</a>, a procura de serviços de Oracle de qualidade também aumentou, afinal grande parte desses protocolos utilizam Smart Contracts que precisam de dados externos para realizar as suas funções.</p><br><p class='article-text'>Nesses casos utilizar de Oracles centralizados não é uma boa escolha, visto que a plataforma se torna vulnerável a ataques e manipulações de dados. Um tipo muito comum de ataque na qual informações são adulteradas para que <a href='/academia/glossario/hacker'>Hackers</a> se aproveitem são os Flash Loans.</p><br><p class='article-text'>Uma opção são os Oracles Descentralizados e é ai que a Chainlink entra em ação, por não possuir centralizadores, seu risco é mitigado, supostamente oferecendo uma maior segurança.</p><br><p class='article-text'>Apesar de ataques em sistemas descentralizados ser algo difícil de acontecer não é impossível. Em setembro de 2020, um ataque na Chainlink removeu cerca de 700 <a href='/academia/descubra/o-que-e-ethereum-eth'>ETH</a> do protocolo, e apesar do ataque ter sido solucionado rapidamente, mostrou que nenhum sistema é 100% seguro.</p><br>",
        
        "<h2 class='article-header'>Considerações Finais</h2><p class='article-text'>Chainlink cumpre bem a sua função de disponibilizar informações externas para protocolos baseados em <a href='/academia/glossario/blockchain'>Blockchain</a>, e devido a sua grande adoção, é considerado um dos projetos mais importantes do ecossistema de <a href='/academia/glossario/criptomoedas'>criptomoedas</a>.</p><br><p class='article-text'>Com o sistema de Oracles descentralizados, informações do mundo externo com alta assertividade podem ser fornecidas por nodes, que serão recompensados por isso. E apesar de muitos projetos dependerem da Chainlink para seu funcionamento, o que traz um certo risco, utilizar de dados reais em sistemas Blockchain é um dos pontos mais importantes para a construção de um ecossistema sólido.</p><br>"],
        "categories": ["blockchain"],
        "image": "LINKLogo.png",
        "date": "29/05/2022",
        "readTime": 6,
        "mainColor": "#2563eb",
        "secondaryColor": "#dbeafe"
    }, 
    {
        "id": 4,
        "title": "Cosmos (ATOM)",
        "url": "o-que-e-cosmos-atom",
        "contentTitle": "O que é Cosmos (ATOM)?",
        "content": ["<p class='article-text'><strong>Depois de mais de uma década desde o Bitcoin aplicar o conceito de Blockchains em criptomoedas, diversos projetos surgiram para tentar solucionar um dos principais desafios do mundo de Blockchains a interoperabilidade.</strong></p><br><p class='article-text'><strong>Com propostas de redes interoperáveis Cosmos é um desses projetos, e talvez o principal quando se trata de interoperabilidade entre Blockchains.</strong></p><br><p class='article-text'><strong>Com ferramentas de desenvolvimento de Blockchains customizáveis e seu mecanismo de consenso Tendermint, Cosmos vem chamando a atenção dos adeptos a criptomoedas, vamos entender o motivo.</strong></p>",

        "<h2 class='article-header'>Introdução</h2><p class='article-text'>Cosmos é um ecossistema de redes que permite aos desenvolvedores criarem  interoperáveis. Cosmos possui uma rede principal chamada de Cosmos Hub, que armazenas os dados e informações de suas Blockchains secundárias as chamadas Zones. Por serem altamente customizáveis, as Zones permitem aos desenvolvedores definirem regras de validação que sejam adequadas aos requisitos da aplicação, além de possibilitar a criação de <a href='/academia/glossario/criptomoedas' >criptomoedas</a> em suas Blockchains.</p><br><p class='article-text'>As Zones são criadas a partir do Cosmos SDK, que serve como ambiente de desenvolvimento da Cosmos para criação de Blockchains. A camada de <a href='/academia/glossario/consenso' >consenso</a> do Cosmos SDK se chama Tendermint Core, que utiliza um mecanismo de consenso baseado em <a href='/academia/glossario/validador' >validadores</a>. Apesar disso, cada Zone é única, e pode definir as próprias regras de como será o processo de validação.</p><br><p class='article-text'>Para a Mainnet da Cosmos Hub a validação é feita pelos 100 principais <a href='/academia/glossario/node' >nodes</a>, selecionados pela quantidade em <a href='/academia/glossario/staking' >staking</a> do token ATOM, o token nativo da rede. Cada validador tem poder de voto baseado em seu stake de ATOM. Para que novos <a href='/academia/glossario/bloco' >blocos</a> sejam criados, um validador principal propõe a criação aos outros validadores, e caso seja aprovada, o validador receberá a <a href='/academia/glossario/block-reward' >recompensa do bloco</a>.</p><br><p class='article-text'>ATOM também é utilizada como <a href='/academia/glossario/token-de-utilidade' >token de utilidade</a> e governança da rede, servindo não só para a validação da Cosmos Hub, mas também para pagar <a href='/academia/glossario/taxa-de-transacao' >taxas de transação</a> e oferecendo aos <a href='/academia/glossario/holder' >holders</a> poder de voto. </p>",

        "<h2 class='article-header'>Como a Cosmos (ATOM) funciona?</h2><p class='article-text'>Cosmos foi fundada em 2014 como um projeto que busca criar uma rede de diferentes <a href='/academia/glossario/blockchain' >Blockchains</a>  que sejam interoperáveis. A rede principal da Cosmos, conhecida como Cosmos HUB, é uma Blockchain que segue o protocolo <a href='/academia/glossario/proof-of-stake-pos' >Proof of Stake (PoS)</a>, e possibilita a criação de Zones, Blockchains secundárias customizáveis.</p><br><p class='article-text'>A Cosmos HUB transfere informações com as Zones conectadas à ela, oferecendo uma maior segurança ao ecossistema. Isso ocorre utilizando um mecanismo de consenso próprio chamado Tendermint, falaremos mais dele ao longo do artigo.</p><br><p class='article-text'>A rede Cosmos é separada em 3 diferentes camadas:</p><ul><li><strong> - Conexão:</strong> Permite que confirmações de transação e mensagens do mecanismo de consenso se comuniquem com as Blockchains Centrais.</li><br><li><strong> - Aplicação:</strong>  Serve para atualizar a rede com as novas transações e balanços de cada carteira.</li><br><li><strong> - Consenso:</strong>  Organiza os acordos entre os nodes e define como será a validação de novas transações.</li></ul><br><br><p class='article-text'>O mecanismo Tendermint utiliza uma ferramenta que automatiza a usabilidade das camadas de conexão e de consenso. Com isso, desenvolvedores podem focar apenas na camada de Aplicação lhes poupando tempo.</p>",
                    
        "<h2 class='article-header'>O que é Cosmos Hub?</h2><p class='article-text'>Cosmos Hub é a Blockchain principal da Cosmos, que serve como eixo para conectar as Blockchains secundárias, conhecidas como Zones. Cosmos Hub mantém um registro de estado de cada uma das Zones através de um <a href='/academia/glossario/protocolo' >protocolo</a> chamado <i>Inter-Blockchain Communication Protocol (IBCP)</i>, com esse protocolo informações podem ser trocadas entre todas as Zones conectadas à Cosmos Hub.</p><br><p class='article-text'>A Cosmos Hub tem a função de ser um centralizador no ecossistema de Zones, recebendo e enviando mensagens IBCP de uma Blockchain para outra. O IBCP possui dois tipos de mensagem, a <i>IBCBlockCommitTx</i> que envia dados sobre o <a href='/academia/glossario/hash' >hash</a> do bloco mais recente de uma respectiva Zone, e a <i>IBCPacketTx</i> que possibilita uma Zone provar que uma informação é legitima e quem a enviou.</p><br><p class='article-text'>Por exemplo, duas aplicações em diferentes Zones querem se comunicar entre si. As informações são enviadas para a Cosmos Hub que às registra em sua Blockchain, e então distribui para as Zones que também registram em suas respectivas Blockchains. Com isso a informação está registrada em 3 lugares diferentes que se comunicam para compartilhar informações, essa habilidade de conectar blockchains fez com que a Cosmos recebesse o apelido de “Internet das Blockchain”</p>",

        "<h2 class='article-header'>O que são as Cosmos Zones?</h2><p class='article-text'>Cosmos Zones são blockchains customizáveis, criadas para o desenvolvimento de aplicações no ecossistema da Cosmos, funcionam como <a href='/academia/glossario/side-chain' >side chains</a>, redes secundárias que operam sob uma blockchain principal. Por serem customizáveis, cada Zone possui um método único para autenticar as transações, criar tokens e aplicações, e interagir com a Blockchain em si.</p><br><p class='article-text'>Como visto antes, as Zones são interoperáveis, e apesar de suas singularidades, todas as Zones são capazes de conectarem-se entre si, mas não é algo obrigatório. No desenvolvimento de Zones, desenvolvedores tem o poder de bloquear a conexão de outras Blockchains.</p><br><p class='article-text'>Zones têm sua infraestrutura em conjunto com os Hubs, que atuam como rotas de transação de dados entre diferentes Zones. Como a rede não tem restrições de permissão, qualquer um pode criar uma Zone ou Hub Blockchain e apesar do Cosmos Hub ser o Hub principal da rede Cosmos, não é o único. Outros Hubs podem ser criados através de <a href='/academia/glossario/fork' >fork</a>, um exemplo disso é a Binance Chain, desenvolvida em 2019.</p>",

        "<h2 class='article-header'>Como funciona o Cosmos SDK?</h2><p class='article-text'>Cosmos SDK é um <a href='/academia/glossario/open-source-software' >sistema open-source</a> que permite desenvolvedores criarem redes customizáveis no ecossistema da Cosmos. O protocolo de consenso padrão do Cosmos SDK é o Tendermint Core, mas existem uma variedade de módulos disponíveis para a escolha do desenvolvedor.</p><br><p class='article-text'>Cosmos SDK simplifica o processo de criação de uma Blockchain, e oferece ferramentas para desenvolvedores criarem suas redes de forma customizada. Utilizando diferentes Plug-ins que já existem na plataforma, desenvolvedores podem definir as regras e requisitos para as Blockchains que estão criando. É possível criar Blockchains públicas que se baseiam no protocolo <a href='/academia/glossario/proof-of-stake-pos' >Proof of Stake (PoS)</a>, ou Blockchains privadas que utilizam o protocolo <a href='/academia/glossario/proof-of-authority-poa' >Proof of Authority (PoA)</a>.</p>",

        "<h2 class='article-header'>O que é ATOM?</h2><p class='article-text'>ATOM é o token nativo da rede Cosmos, é utilizado tanto como token de utilidade da rede quanto token de governança.</p><br><ul><li><strong> - Usuários usam ATOM para pagar taxas de transação da rede.</strong></li><br><li><strong> - No sistema de governança da Cosmos Hub, onde o poder de voto na plataforma é definido pela quantidade de ATOM que o usuário possui.</strong> </li><br><li><strong> - Usuários podem receber recompensas ao fazer o Staking de seus tokens em valiadores.</strong></li></ul><br><br><p class='article-text'>ATOM teve sua distribuição em um <a href='/academia/glossario/initial-coin-offering-ico' >ICO</a> em Abril de 2017, o preço de lançamento do token foi U$0,10 e em sua <a href='/academia/glossario/alta-historica-ath' >alta histórica (ATH)</a> o token atingiu U$44,00. ATOM não possui um <a href='/academia/glossario/max-supply' >Max Supply</a> definido e a criação de novos tokens é feita pelo Tendermint Core que recompensa os validadores a cada bloco.</p>",

        "<h2 class='article-header'>O que é Tendermint?</h2><p class='article-text'>Tendermint é um protocolo na qual permite que aplicações sejam criadas e se conectem ao Tendermint Core, mecanismo de <a href='/academia/glossario/consenso' >consenso</a> padrão da Cosmos. Tendermint Core é um sistema Byzantine Fault Tolerant (BFT), basicamente significa que transações podem ser confirmadas mesmo que os participantes não se cooperem ou sejam maliciosos, BFT dispensa a confiança, sendo considerado um sistema <a href='/academia/glossario/trustless' ><i>trustless</i></a>.</p><br><p class='article-text'>Com Tendermint Core <a href='/academia/glossario/validador' >validadores</a> podem executar nodes que guardarão cópias dos dados da blockchain, e validarão novas transações. Validadores que confirmarem transações votam em novos blocos a serem adicionados na Blockchain.</p><br><p class='article-text'>Mas essa é uma tarefa limitada, já que somente os 100 principais nodes se tornam validadores, sendo definido pela quantidade do token ATOM em staking pelo node. O poder de voto de cada validador também depende da quantidade de ATOM em <a href='/academia/glossario/staking' >staking</a>.</p><br><p class='article-text'>Usuários que desejam receber as recompensas como os validadores, mas que não possuem a quantidade necessária para entrar no top 100 nodes podem delegar seus tokens para nodes que já são validadores. Com isso, caso o validador escolhido receba a recompensa do bloco, o usuário receberá uma parte da recompensa com base na quantidade delegada.</p><br><p class='article-text'>Esse mecanismo incentiva a boa atuação dos validadores, já que usuários podem facilmente trocar o validador que desejam delegar seus tokens para um mais competente. Para que novos blocos sejam criados, o grupo de 100 validadores deve chegar a um consenso através de votos.</p>",

        "<h2 class='article-header'>Considerações finais</h2><p class='article-text'>Cosmos entende o desafio da <a href='/academia/glossario/interoperabilidade' >interoperabilidade</a> e busca se antecipar sendo um dos primeiros projetos a procurar uma solução para isso, oferecendo uma plataforma que permite desenvolvedores criarem aplicações com Blockchains próprias e altamente customizáveis. </p><br><p class='article-text'>Diversas aplicações já foram lançadas no ecossistema da Cosmos, como <a href='/academia/glossario/decentralized-exchange-dex' >Exchanges Descentralizadas</a>, Marketplaces de <a href='/academia/glossario/nft-tokens-nao-fungiveis' >NFT</a> NFT, e uma variedade de <a href='/academia/glossario/aplicacao-descentralizada-dapp' >DApps</a>.</p><br><p class='article-text'>Redes interoperáveis ainda não possuem dominância do mercado, sendo que a preferência segue sendo soluções de segunda camada para Blockchains de grande porte, como a <a href='/academia/descubra/o-que-e-polygon-matic' >Polygon</a> e <a href='/academia/descubra/o-que-e-avalanche-avax' >Avalanche</a> são da <a href='/academia/descubra/o-que-e-ethereum-eth' >Ethereum</a>. Mas com o crescimento das redes interoperáveis essa dominância pode mudar.</p>"],
        "categories": ["blockchain"],
        "image": "ATOMLogo.png",
        "date": "09/06/2022",
        "readTime": 8,
        "mainColor": "#57534e",
        "secondaryColor": "#f5f5f4"
    },
    {
        "id": 5,
        "title": "Ethereum (ETH)",
        "url": "o-que-e-ethereum-eth",
        "contentTitle": "O que é Ethereum (ETH)?",
        "content": ["<h2 class='article-header'>Capítulos</h2><p class='article-text'><ul class='chapterSection'><li><span>-</span><a href='#capitulo1'><h3 class='chapter'>Fundamentos da Ethereum</h3></a></li><li><span>-</span><a href='#capitulo2'><h3 class='chapter'>De onde vem o Ether?</h3></a></li><li><span>-</span><a href='#capitulo3'><h3 class='chapter'>Primeiros passos com Ethereum</h3></a></li><li><span>-</span><a href='#capitulo4'><h3 class='chapter'>Escalabilidade, ETH 2.0 e o Futuro da Ethereum</h3></a></li><li><span>-</span><a href='#capitulo5'><h3 class='chapter'>Ethereum e Finanças Descentralizadas (DeFi)</h3></a></li><li><span>-</span><a href='#capitulo6'><h3 class='chapter'>Participando na rede Ethereum</h3></a></li></ul></p>",

        "<h2 id='capitulo1' class='article-header'>Capítulo 1 <br><small>Fundamentos da Ethereum</small></h2><p class='article-text'> Conteúdos<ul class='chapterSection'><li><span>-</span><a href='#introducaoAoEthereum'><h4 class='chapter'>Introdução ao Ethereum</h4></a></li><li><span>-</span><a href='#ethereumXEther(ETH)'><h4 class='chapter'>Ethereum x Ether (ETH)</h4></a></li><li><span>-</span><a href='#oQueTornaAEthereumValiosa'><h4 class='chapter'>O que torna a Ethereum valiosa?</h4></a></li><li><span>-</span><a href='#oQueEBlockchain'><h4 class='chapter'>O que é Blockchain?</h4></a></li><li><span>-</span><a href='#qualADiferencaDeEthereumEBitcoin'><h4 class='chapter'>Qual a diferença de Ethereum e Bitcoin?</h4></a></li><li><span>-</span><a href='#comoAEthereumFunciona'><h4 class='chapter'>Como a Ethereum fuciona?</h4></a></li><li><span>-</span><a href='#oQueSaoSmartContracts'><h4 class='chapter'>O que são Smart Contracts?</h4></a></li><li><span>-</span><a href='#quemCriouOEthereum'><h4 class='chapter'>Quem criou o Ethereum?</h4></a></li><li><span>-</span><a href='#comoFoiADistribuicaoDeEther'><h4 class='chapter'>Como foi a distribuição de Ether?</h4></a></li><li><span>-</span><a href='#theDaoEOEthereumClassic'><h4 class='chapter'>'The DAO' e o Ethereum Classic</h4></a></li></ul></p>",

        "<h2 class='article-header' id='introducaoAoEthereum'>Introdução</h2><p class='article-text'>Ethereum é uma plataforma descentralizada que não roda em apenas um aparelho, mas sim em milhares de aparelhos simultaneamente espalhados no mundo todo, isso significa que a Ethereum não tem dono.</p><p class='article-text'>Assim como o <a href='/academia/glossario/bitcoin' >Bitcoin</a>, a Ethereum possibilita a transferência de dinheiro digital (criptomoedas). É possível também lançar aplicativos próprios e interagir com aplicativos já existentes no ecossistema da Ethereum</p> <br><p class='article-text'>Em resumo, a idéia principal da Ethereum é possibilitar desenvolvedores lançarem aplicações em uma rede distribuída ao invés utilizarem servidores <a href='/academia/glossario/centralizado' >centralizados</a>. Isso significa que, na teoria, essas aplicações não podem ser derrubadas ou censuradas.</p>",

        "<h2 class='article-header' id='ethereumXEther(ETH)'>Ethereum x Ether (ETH)</h2><p class='article-text'>As moedas utilizadas na rede Ethereum por mais intuitivo que pareça não se chamam Ethereums. Na verdade Ethereum é o nome do protocolo, enquanto a moeda utilizada para impulsionar a rede chama-se Ether (ou ETH)</p>",
        
        "<h2 class='article-header' id='oQueTornaAEthereumValiosa'>O que torna a Ethereum valiosa?</h2><p class='article-text'>Vimos anteriormente que a idéia da Ethereum é possibilitar aplicações através de sistemas distribuídos.  Assim, programas não poderão ser adulterados por terceiros.</p><br><p class='article-text'>Depois de adicionados a base de dados da Ethereum (Conhecida como <a href='/academia/glossario/blockchain' >Blockchain</a>), sistemas podem ser programados de forma a não ser possível editá-los. Essa base de dados pode ser visualizada por qualquer um e qualquer usuário pode auditar o sistema antes de interagir com ele.</p><br><p class='article-text'>Isso significa que qualquer pessoa em qualquer lugar pode desenvolver e lançar aplicações que não podem ser desligadas. Outro ponto interessante é que por sua moeda nativa, Ether, servir como <a href='/academia/glossario/reserva-de-valor' >reserva de valor</a>, essas aplicações podem determinar condições de como valor é transferido.</p><br><p class='article-text'>Os programas que fazem essas aplicações chamam-se <a href='/academia/glossario/smart-contracts' >Smart Contracts</a> e podem ser operados sem a necessidade de atividade humana.</p>",

        "<h2 class='article-header' id='oQueEBlockchain'>O que é Blockchain?</h2><p class='article-text'>Blockchain é a peça principal da Ethereum, sendo uma base de dados que guarda toda a informação do <a href='/academia/glossario/protocolo' >protocolo</a>. A Blockchain da Ethereum é muito similar à blockchain do <a href='/academia/glossario/bitcoin' >Bitcoin</a> apesar das informações que são guardadas e a forma que são guardadas, serem um pouco diferente.</p><br><p class='article-text'>Pense na blockchain da Ethereum como um livro, onde você adiciona páginas continuamente, cada página desse livro possui informações sobre as transações, e são chamados de <a href='/academia/glossario/bloco' >bloco</a>. Caso queira adicionar um novo bloco é necessário ter um valor, onde mostra que esse bloco vem após um bloco anterior e não foi adicionado aleatoriamente no meio do livro.</p><br><p class='article-text'>Basicamente, é como se fosse o número da página de um livro que referencia uma página anterior. Ao olhar para uma nova página saberemos qual foi a página anterior por causa do seu número, e isso ocorre com os blocos também.</p><br><p class='article-text'>Se olharmos para o “bloco 6”, saberemos que o bloco anterior foi o “bloco 5”. E para fazer isso, utiliza-se do processo chamado Hashing.</p><br><p class='article-text'>Hashing pega toda a informação da nossa página (bloco) e retorna um valor único chamado de <a href='/academia/glossario/hash' >Hash</a>.  As chances de dois hashes possuírem o mesmo valor são absurdamente pequenas, e seu processo não pode ser feito reversamente, ou seja, é facilmente possível transformar informações em um hash, mas usar um hash para adquirir as informações é impossível. E é muito importante que seja dessa forma para o processo de <a href='/academia/glossario/mineracao' >mineração</a>, falaremos disso mais tarde.</p><br><p class='article-text'>Então com a <a href='/academia/glossario/blockchain' >Blockchain</a> possuímos um mecanismo que nos permite adicionar informações em blocos e juntar esses <a href='/academia/glossario/bloco-genesis' >blocos</a> de forma cronológica, esses blocos não podem ser alterados e nem adicionados em lugares indevidos. Toda a informação do bloco está visível (Em forma de <a href='/academia/glossario/hash' >hash</a>) para que caso seja adulterado todos os usuários da rede poderão perceber.</p><br><p class='article-text'>Blockchain é um mecanismo muito importante se não o mais importante no mundo de criptomoedas, ele permite que a informação na rede seja segura e sólida. Quer saber mais sobre o que são Blockchains e todas suas funcionalidades? <a href='/academia/guias/blockchain' >Acesse nosso guia de Blockchain.</a> </p>",

        "<h2 class='article-header' id='qualADiferencaDeEthereumEBitcoin'>Qual a diferença de Ethereum e Bitcoin?</h2><p class='article-text'>Bitcoin utiliza como base a tecnologia <a href='/academia/glossario/blockchain' >Blockchain</a> e outros incentivos financeiros para ser um sistema global de dinheiro digital, e introduziu sistemas inovadores que permitiram que usuários se comunicassem na rede sem um centralizador. Com cada usuário executando um programa no seu computador, <a href='/academia/glossario/bitcoin' >Bitcoin</a> possibilitou uma base de dados financeira que seja <a href='/academia/glossario/trustless'>trustless</a> em um ambiente <a href='/academia/glossario/descentralizado' >descentralizado</a>.</p><br><p class='article-text'>Bitcoin é uma blockchain de primeira-geração. Não possuindo sistemas complexos, ou com uma boa escalabilidade, sendo intencionalmente inflexível. Porém, em questões de segurança, isso o torna extremamente forte. Por ser inflexível, não aceita muito bem aplicações que não sejam transferências de moeda, fazendo com que desenvolvedores optem por blockchain com mais funcionalidades.</p><br><p class='article-text'>As blockchains de segunda-geração, em comparação, são muito mais poderosas, possibilitam o desenvolvimento de aplicações dentro do seu ecossistema. A Ethereum oferece aos desenvolvedores a possibilidade de utilizarem seus códigos como quiserem para criar as chamadas <a href='/academia/glossario/aplicacao-descentralizada-dapp' >aplicações descentralizadas (DApp)</a>.</p><br><p class='article-text'>Ethereum foi a primeira blockchain de segunda-geração, e até hoje segue sendo a mais potente. Possui similaridades com o Bitcoin e traz muitas de suas funcionalidades, porém, ambas possuem diferenças, vantagens e desvantagens em diferentes aspectos.</p>",

        "<h2 class='article-header' id='comoAEthereumFunciona'>Como a Ethereum funciona?</h2><p class='article-text'>Podemos definir a Ethereum como uma galeria de fotos, onde em todo momento temos um PrintScreen de como está o balanço de todas as contas e todos os <a href='/academia/glossario/smart-contracts' >smart contracts</a> da rede. Algumas ações causarão mudanças e será necessário que todos os <a href='/academia/glossario/node' >nodes</a> atualizem seus PrintScreen para o mais recente.</p><br><p class='article-text'>Os smart contracts que rodam na Ethereum são acionados por transações, sejam elas entre usuário, ou entre contratos. Quando um <a href='/academia/glossario/node' >node</a> (usuário da rede) envia uma transação a um contrato, todos os nodes rodam o contrato e guardam a resposta (PrintScreen mais recente). Isso se dá devido a Ethereum Virtual Machine (EVM), um sistema que converte smart contracts para instruções que o computador pode realizar.</p>",

        "<h2 class='article-header' id='oQueSaoSmartContracts'>O que são Smart Contracts?</h2><p class='article-text'>Um <a href='/academia/glossario/smart-contracts' >Smart Contract</a> (ou contrato inteligente), é um código que se executa sozinho, sem ação humana, caso certas condições previamente estabelecidas sejam executadas. Pense como uma Máquina de Vendas, nelas contratos simples ocorrem, o usuário coloca dinheiro e em troca a máquina dispensa o produto que o usuário escolheu. Smart Contracts, seguem a mesma linha de raciocínio.</p><br><p class='article-text'>Por exemplo, um contrato inteligente que tem a função pré estabelecida de mostrar um texto caso esse contrato receba certa quantidade de Ether, digamos 2 Ether.</p><br><p class='article-text'>Condição do contrato: Mostrar “ Olá, seja bem-vindo” quando 2 Ether serem enviados ao contrato. <br><br><strong>João</strong> <span class='detailSpan'>>></span> <strong>Envia 2 Ether para o</strong>  <span class='detailSpan'>>>  </span> <strong> Contrato;</strong> <br><br><strong>Contrato</strong> <span class='detailSpan'>>></span> <strong>Envia “Olá, seja bem-vindo” para</strong>  <span class='detailSpan'>>></span> <strong> João;</strong><br><br></p><p class='article-text'>Na Ethereum, os desenvolvedores criam códigos com essas especificações que depois são lidos pela <a href='/academia/glossario/ethereum-virtual-machine-evm' >EVM</a>. Eles então tornam o contrato público ao enviá-lo para um <a href='/academia/glossario/endereco' >endereço</a> que registra o contrato. Após isso, qualquer um pode utilizar o contrato e executar as funções determinadas por ele. Contratos não podem ser excluídos, a não ser que uma condição específica para que isso ocorra tenha sido determinada pelo desenvolvedor.</p><br><p class='article-text'>Com o contrato em um endereço basta enviar 2 Ether (segundo o exemplo anterior) para esse endereço que o contrato será acionado, sendo rodado em todos os <a href='/academia/glossario/node' >nodes</a> da rede, validando se o pagamento foi realmente feito e assim, gravando a resposta na <a href='/academia/glossario/blockchain' >blockchain</a> (“Olá, seja bem-vindo”).</p><br><p class='article-text'><a href='/academia/glossario/smart-contracts' >Smart Contracts</a> possibilitam aplicações muito mais sofisticadas e complexas, e o exemplo acima é uma das formas mais básicas de se explicar o poder de um smart contract.</p>",

        "<h2 class='article-header' id='quemCriouOEthereum'>Quem criou o Ethereum?</h2><p class='article-text'>Em 2008, um desenvolvedor (ou grupo de desenvolvedores) com o pseudônimo de <a href='/academia/glossario/satoshi-nakamoto' >Satoshi Nakamoto</a>, publicou em um blog o  Whitepaper do <a href='/academia/glossario/' >Bitcoin</a>, um sistema que mudaria como o dinheiro digital se comporta, e em 2013, um jovem programador chamado Vitalik Buterin, decidiu usar o conceito do Bitcoin e aplicá-lo em qualquer tipo de aplicação. Criando assim o Ethereum.</p><br><p class='article-text'>Sua primeira aparição foi em um blog com o título <i>Ethereum: The Ultimate Smart Contract and Decentralized Application Platform.</i> Buterin descreveu sua idéia para uma blockchain Turing-complete, um sistema <a href='/academia/glossario/descentralizado' >descentralizado</a> que poderia rodar qualquer aplicação.</p>",

        "<h2 class='article-header' id='comoFoiADistribuicaoDeEther'>Como foi a distribuição de Ether?</h2><p class='article-text'>Ether lançou em 2015 com um supply inicial de 72 milhões de Ether, onde 50 milhões foram distribuídos em uma venda pública chamada de <a href='/academia/glossario/initial-coin-offering-ico' >Inital Coin Offering (ICO)</a>, onde aqueles que quisessem participar, poderiam comprar Ether com Bitcoin ou <a href='/academia/glossario/moeda-fiduciaria' >Moedas Fiduciárias</a>. O preço de lançamento do Ether foi de aproximadamente $0,31 e na data em que escrevemos esse artigo o preço já se encontra acima de $2.000,00</p>",

        "<h2 class='article-header' id='theDaoEOEthereumClassic'>'The DAO' e o Ethereum Classic</h2><p class='article-text'>A Ethereum possibilitou que usuários da rede colaborassem entre si através da Internet de forma descentralizada, um exemplo disso são as <a href='/academia/glossario/decentralized-autonomous-organization-dao' >DAOs (Decentralized Autonomous Organization)</a>, entidades governadas por códigos de computadores. </p><br><p class='article-text'>Um exemplo de organização assim foi “The DAO”, uma aplicação da rede Ethereum criada em 2016 sobre <a href='/academia/glossario/smart-contracts' >Smart Contracts</a> complexos que funcionava como uma plataforma autônoma de investimento de <a href='/academia/glossario/capital-de-risco' >capital de risco</a>. DAO tokens eram distribuídos em <a href='/academia/glossario/initial-coin-offering-ico' >ICOs</a> e aqueles que os possuíam eram capazes de realizar stake e tinham direito de voto.</p><br><p class='article-text'>Tempo depois de seu lançamento, atores maliciosos encontraram uma vulnerabilidade e retiraram cerca de 30% dos fundos que estavam na plataforma, vale lembrar, que naquela época a Ethereum não era tão grande como é hoje, e cera de 14% de todo o <a href='/academia/glossario/circulating-supply' >supply</a> de Ether estava travado na The DAO.</p><br><p class='article-text'>Após algumas conferências, decidiram separar a <a href='/academia/glossario/blockchain' >blockchain</a> da Ethereum em duas em um processo chamado Hard Fork. Em uma blockchain, as transações maliciosas foram revertidas para recuperar os fundos, sendo essa a rede utilizada hoje em dia na Ethereum, já a rede original, as transações não foram revertidas e é conhecida como <a href='/criptomoedas/ethereum-classic' >Ethereum Classic</a>.</p>",

        "<h2 id='capitulo2' class='article-header'>Capítulo 2 <br><small>De onde vem o Ether?</small></h2><p class='article-text'> Conteúdos:<ul class='chapterSection'><li><span>-</span><a href='#comoOEtherECriado'><h4 class='chapter'>Como o Ether é criado?</h4></a></li><li><span>-</span><a href='#comoFuncionaAMineracaoNaEthereum'><h4 class='chapter'>Como funciona a mineração na Ethereum?</h4></a></li><li><span>-</span><a href='#oQueEOGasDaEthereum'><h4 class='chapter'>O que é o Gas da Ethereum?</h4></a></li><li><span>-</span><a href='#gasLimit'><h4 class='chapter'>Gas Limit</h4></a></li><li><span>-</span><a href='#quantoTempoLevaParaUmBlocoSerMineradoNaEthereum'><h4 class='chapter'>Quanto tempo leva para um bloco ser minerado na Ethereum?</h4></a></li><li><span>-</span><a href='#oQueSaoTokensDaEthereum'><h4 class='chapter'>O que são Tokens da Ethereum?</h4></a></li></ul></p>",
        
        "<h2 class='article-header' id='comoOEtherECriado'>Como o Ether é criado?</h2><p class='article-text'>Você já deve ter ouvido falar sobre o processo de <a href='/academia/glossario/mineracao' >mineração</a>, caso esteja familiarizado com <a href='/academia/glossario/bitcoin' >Bitcoin</a>, sabe que minerar é um processo fundamental para manter a segurança e a constante atualização da <a href='/academia/glossario/blockchain' >Blockchain</a>. Na Ethereum é a mesma coisa, o protocolo recompensa com Ether os <a href='/academia/glossario/mineradores' >mineradores</a> que disponibilizam seu poder computacional para manter a rede ativa.</p><br><p class='article-text'>Em maio de 2022, o <a href='/academia/glossario/circulating-supply' >Circulating Supply</a>  de Ether é por volta de 120 milhões, e diferente do Bitcoin, que possui em sua essência o sistema <a href='/academia/glossario/halving' >Halving</a> e um max supply de 21 milhões de BTC, o Ether não possui um Max Supply definido. Como o objetivo da Ethereum é criar uma rede de <a href='/academia/glossario/aplicacao-descentralizada-dapp' >aplicações descentralizadas (DApps)</a>, não se sabe com clareza, se definir um <a href='/academia/glossario/max-supply' >max supply</a> é a melhor pedida pra rede, e essa é uma questão que segue aberta e é fortemente discutida.</p>",

        "<h2 class='article-header' id='comoFuncionaAMineracaoNaEthereum'>Como funciona a mineração na Ethereum?</h2><p class='article-text'>Como visto antes, <a href='/academia/glossario/mineracao' >mineração</a> é fundamental para manter a rede segura e atualizada, além de permitir a sua funcionalidade sem que tenha um centralizador tomando as decisões. Na mineração, os <a href='/academia/glossario/node' >nodes</a> participantes (conhecidos como <a href='/academia/glossario/mineradores' >mineradores</a>) dedicam poder computacional de suas máquinas para criptografar dados.</p><br><p class='article-text'>O que eles estão fazendo na realidade é transformar as transações pendentes da blockchain, junto com mais alguns dados em um <a href='/academia/glossario/hash' >hash</a>, para que o <a href='/academia/glossario/bloco' >bloco</a>seja validado deve se encontrar o valor exato do hash desse bloco, e caso não seja feito com sucesso o minerador (ou no caso a sua máquina) pode mudar alguns dados e tentar novamente.</p><br><p class='article-text'>A competição na mineração é acirrada, e por isso, mineradores precisam ser capazes de transformar dados em hash o mais rápido possível, e uma métrica para definir isso é o <a href='/academia/glossario/hash-rate' >Hash Rate</a>, que define (geralmente por segundo) a quantidade de hash que é solucionada. Só é necessário que um minerador de toda a rede encontre o a solução, visto que depois é fácil para outros nodes checarem se isso é válido.</p><br><p class='article-text'>Como o exemplo que demos anteriormente, pense em um livro, e que estamos atualmente na página número 332.</p><br><p class='article-text'>A máquina gera um número aleatório de zero a 1 milhão, e segue gerando números aleatórios até que encontre o número exato da próxima página (nesse caso, 333). Todos os computadores da rede vão gerando esses números aleatórios e assim que um encontrar o número 333, todos saberão que o problema foi solucionado, e poderão validar se o problema foi realmente solucionado visto que na página (hash) 333 possui informações da página (hash) anterior, nesse caso 332.</p><br><p class='article-text'>Após isso o jogo segue, e as máquinas passarão a buscar o próximo hash, em um “livro de páginas infinitas”.</p><br><p class='article-text'>Mas todo esse trabalho deve ser recompensado, afinal o <a href='/academia/glossario/mineradores' >minerador</a> está empregando grande esforço computacional para manter a rede viva. E é assim que novos Ether são gerados, a cada bloco novo gerado os mineradores recebem 2 novos Ether, além de todas as <a href='/academia/glossario/taxa-de-transacao' >taxas de transação</a> pagas pelos usuários da rede.</p>",

        "<h2 class='article-header' id='oQueEOGasDaEthereum'>O que é o Gas da Ethereum?</h2><p class='article-text'>Ao se executar programas na rede Ethereum, não estamos executando-os apenas na nossa máquina, mas sim em todas as máquinas do ecossistema da Ethereum. Se pensarmos no nosso exemplo do “Olá, seja bem-vindo” é algo bem simples certo, agora imagine um programa complexo sendo executado em todas as máquinas da rede.</p><br><p class='article-text'>Mas diversas pessoas utilizam da rede ao mesmo tempo, então como seria se dezenas de milhares de pessoas executassem programas complexo que também rodarão em todas as máquinas. Isso colocaria um grande peso e consumiria todos os recursos da rede, provavelmente resultando em um colapso.</p><br><p class='article-text'>Pensando nisso, para mitigar os riscos, a Ethereum introduziu o conceito de <a href='/academia/glossario/gas-price' >Gas</a>. É como se fosse o combustível da rede Ethereum, Assim como seu carro não anda sem combustível, <a href='/academia/glossario/smart-contracts' >contratos</a> não são executados sem Gas. Cada contrato para ser executado determina uma quantidade de Gas que deve ser paga pelo usuário, caso não tenha Gas suficiente, o contrato não será executado.</p><br><p class='article-text'>Basicamente se torna um mecanismo de taxas, taxas essas que são pagas aos mineradores por manter a rede com recursos e suprir essa demanda de poder computacional necessário para executar todos esses programas.</p><br><p class='article-text'>Quando você faz transações você paga o Gas em Ether, mas isso não quer dizer que são a mesma coisa. O preço do Gas varia e geralmente é definido pelos <a href='/academia/glossario/mineradores' >mineradores</a>. Caso a rede esteja congestionada, com muitas pessoas solicitando transações ao mesmo tempo, o preço médio de Gas tende a subir, ao contrário, em momentos com poucas transações, vemos o preço diminuir.</p><br><p class='article-text'>Mesmo que o preço do Gas varie, cada operação tem um preço fixo que é obrigatório, ou seja, contratos complexos que demandarão mais recursos da Ethereum terão um custo mais alto do que aqueles mais simples. Com isso, o Gas garante que a rede se mantenha estável cobrando a taxa apropriada para o usuário conforme quanto recurso da rede ele está consumindo. </p><br><p class='article-text'>Gas geralmente custa uma fração do Ether chamada de <a href='/academia/glossario/gwei' >Gwei</a>, na qual 1 gwei corresponde 1 bilionésimo de um Ether.</p>",

        "<h2 class='article-header' id='gasLimit'>Gas Limit</h2><p class='article-text'>Ao fazer uma transação para um contrato, sua solicitação entra na rede e conforme o congestionamento, o preço e o tempo que levará para a solicitação ser executada serão alterados. Caso deseje que sua transação seja feita o mais rápido possível, pode-se definir um <a href='/academia/glossario/gas-price' >Gas Price</a> mais alto para incentivar os mineradores a priorizar a sua solicitação.</p><br><p class='article-text'>Com isso é possível definir também o <a href='/academia/glossario/gas-limit' >Gas Limit</a> que servirá para proteger caso algo dê errado e irá consumir mais Gas do que o planejado. Por exemplo, para essa transação que desejamos que ocorra o mais rápido possível definimos um limite na qual aceitamos pagar, e assim que esse valor limite de Gas é utilizado a operação irá parar. O contrato falhará mas isso impedirá que o usuário pague mais do que inicialmente tinha definido como seu limite.</p><br><p class='article-text'>Por mais confuso que isso seja, a maioria das <a href='/academia/glossario/wallet' >Wallets</a> já são preparadas para cuidar disso automaticamente, por mais que você possa também definir de forma manual. Em um resumo, Gas Price é o preço que você pagará para sua transação ocorrer, e que também determinará o quão rápido os mineradores realizarão sua transação, e o Gas Limit é o preço Maximo que você aceita pagar por isso.</p>",
            
        "<h2 class='article-header' id='quantoTempoLevaParaUmBlocoSerMineradoNaEthereum'>Quanto tempo leva para um bloco ser minerado na Ethereum?</h2><p class='article-text'>O tempo médio que um novo bloco leva para ser adicionado a <a href='/academia/glossario/blockchain' >blockchain</a> é de 12 a 18 segundos. Mas com a transição para <a href='/academia/glossario/proof-of-stake-pos' >Proof of Stake (PoS)</a> que busca trazer, além de outras mudanças, uma maior velocidade na criação de novos blocos, esse tempo pode mudar.</p>",

        "<h2 class='article-header' id='oQueSaoTokensDaEthereum'>O que são Tokens da Ethereum?</h2><p class='article-text'>Uma das funcionalidades da Ethereum que oferece poder as suas aplicações é a possibilidade dos usuários criarem seus próprios ativos, na qual podem ser transferidos e armazenados assim como o Ether. As regras desses ativos são definidas em <a href='/academia/glossario/smart-contracts' >smart contracts</a> e com isso, desenvolvedores determinam as usabilidades e comportamento de cada a Token, isso inclui como são criados, se são divisíveis, únicos, <a href='/academia/glossario/max-supply' >Max Supply</a>, se são fungíveis ou não e muitas outras coisas.</p><br><p class='article-text'>Existem diversos <a href='/academia/glossario/protocolo' >protocolos</a> de criação de tokens da rede Ethereum sendo o mais utilizado e considerado o protocolo padrão para tokens fungíveis (Criptomoedas) o <a href='/academia/glossario/erc-20' >ERC-20</a>, e o protocolo padrão para tokens não fungíveis (NFTs) o <a href='/academia/glossario/erc-721' >ERC-721</a>.</p><br><p class='article-text'>A funcionalidade dos tokens permite que cada aplicação seja única, cada uma tendo uma usabilidade diferente com sua própria moeda, as possibilidades de uso de <a href='/academia/glossario/tokens' >tokens</a> em aplicações são imensas, e com certeza no futuro veremos usos muito superiores aos que já temos hoje.</p>",

        "<h2 id='capitulo3' class='article-header'>Capítulo 3<br><small>Primeiros passo com Ethereum</small></h2><p class='article-text'> Conteúdos:<ul class='chapterSection'><li><span>-</span><a href='#comoPossoUsarOEther(ETH)'><h4 class='chapter'>Como posso usar o Ether (ETH)</h4></a></li><li><span>-</span><a href='#comoEuProtejoMeusETH'><h4 class='chapter'>Como eu protejo meus ETH?</h4></a></li><li><span>-</span><a href='#qualAMelhorFormaDeGuardarETH'><h4 class='chapter'>Qual a melhor forma de guardar ETH?</h4></a></li><li><span>-</span><a href='#guardandoMinhasCriptomoedasEmExchange'><h4 class='chapter'>Guardando minhas criptomoedas em Exchange</h4></a></li><li><span>-</span><a href='#guardandoMinhasCriptomoedasEmWallet'><h4 class='chapter'>Guardando minhas criptomoedas em Wallet</h4></a></li></ul></p>", 

        "<h2 class='article-header' id='comoPossoUsarOEther(ETH)'>Como posso usar o Ether (ETH)</h2><p class='article-text'>Ethereum, diferente do Bitcoin, é uma plataforma com o objetivo de criar <a href='/academia/glossario/aplicacao-descentralizada-dapp' >aplicações descentralizadas</a>, e tendo o Ether como a moeda principal de troca ele se torna o combustível para o ecossistema.</p><br><p class='article-text'>Mas além de ser o token de utilidade da Ethereum, e ser utilizado para manter a rede ativa, pagar taxas, e realizar atividades com <a href='/academia/glossario/smart-contracts' >contratos inteligentes</a>, o Ether é utilizado como uma moeda de troca, similar às moedas tradicionais. É possível comprar bens e serviços do mundo real utilizando Ethereum, e cada vez mais, sua aceitação é disseminada pelo mundo.</p><br><p class='article-text'>Apesar do ETH possuir similaridades com <a href='/academia/glossario/bitcoin' >Bitcoin</a> e também ser utilizado como moeda digital, garantia de empréstimos, e até reserva de valor, a rede Ethereum é muito mais complexa e possibilita diversos novos usos para o ETH. Por ser altamente programável, possibilitando a criação de aplicações em seu ecossistema, a moeda nativa da rede Ethereum pode ser utilizada em aplicações de <a href='/academia/glossario/decentralized-finance-defi' >finanças descentralizadas (DeFi)</a>, jogos, redes sociais, <a href='/academia/glossario/decentralized-exchange-dex' >Exchanges descentralizadas (DEX)</a> e uma infinidade de aplicações que os desenvolvedores decidirem criar.</p>",
        
        "<h2 class='article-header' id='comoEuProtejoMeusETH'>Como eu protejo meus ETH?</h2><p class='article-text'>Como em criptomoedas não se têm o envolvimento de bancos, a segurança e responsabilidades de seus ativos são suas. É possível guardar suas moedas em <a href='/academia/glossario/exchange' >Exchanges</a>, ou em uma <a href='/academia/glossario/wallet' >Wallet</a> própria. Em Exchanges seu dinheiro lá guardado fica em responsabilidade da Exchange, porém isso perde a descentralização, alguns acham mais seguro por ser uma empresa que cuida de seus fundos, outros acham que perde segurança pois a moeda não está de fato sobre seu domínio, e caso a Exchange tenha tendências maliciosas, seu dinheiro pode estar em risco.</p><br><p class='article-text'>Caso opte por guardar suas moedas em uma wallet própria, também deve-se ter muita atenção com a frase de recuperação da conta, a <a href='/academia/glossario/seed-phrase' >seed phrase</a>. Cada conta possui uma, e sem ela não será possível reconectar à sua conta caso perca o acesso.</p>",
        
        "<h2 class='article-header' id='qualAMelhorFormaDeGuardarETH'>Qual a melhor forma de guardar ETH?</h2><p class='article-text'>Ambas as formas possuem seus prós e contras, e como tudo que envolve risco, uma boa opção é diversificar entre mais de uma opção. Hoje no mercado existe uma gama de formas de guardar criptomoedas e deve se analisar qual faz mais sentido para você.</p><p class='article-header' id='guardandoMinhasCriptomoedasEmExchange'><strong>Guardando minhas criptomoedas em Exchange</strong></p><p class='article-text'>Ao utilizar de Exchange seu dinheiro está em <a href='/academia/glossario/custodia' >custódia</a>, ou seja, você confia suas moedas a essas empresas para que elas cuidem para você, é como se fosse um banco onde você deixa a responsabilidade de cuidar de seus ativos e em troca, usam de suas moedas em investimentos, ou para realizar o câmbio dentro da sua própria plataforma.</p><br><p class='article-text'>Nas exchanges, geralmente você deposita um valor em <a href='/academia/glossario/moeda-fiduciaria' >moeda fiduciária</a>, e compra as criptomoedas que você deseja ou deposita diretamente a criptomoeda de sua wallet. </p><br><p class='article-text'>Geralmente plataformas de Exchange oferecem diversos serviços para que seu dinheiro possa render ao invés de deixá-lo parado na sua conta. <a href='/academia/glossario/staking' >Stake</a>, Plataformas de <a href='/academia/glossario/initial-coin-offering-ico' >ICO</a>, Pool de liquidez, e Pool de mineração, são alguns desses exemplos.</p><br><p class='article-text'>Caso deseje guardar suas moedas em Exchange, temos uma sessão com várias delas para que você decida qual combina mais com você.</p><p class='article-header' id='guardandoMinhasCriptomoedasEmWallet'><strong>Guardando minhas criptomoedas em Wallet</strong></p><p class='article-text'>Já com as Wallets, as carteiras de criptomoedas, seu dinheiro fica sob sua responsabilidade. <a href='/academia/glossario/wallet' >Wallets</a> são carteiras digitais, que possuem <a href='/academia/glossario/endereco' >endereços</a> na qual recebem e enviam criptomoedas. Ao utilizar de Wallets você tem o controle total de seu dinheiro, e é de extrema importância manter guardada a sua seed phrase, uma sequência de palavras, geralmente 12 ou 16 que com elas você poderá acessar sua conta.</p><br><p class='article-text'>Wallets geralmente não têm recuperação de conta, e uma vez que tenha esquecido ou perdido sua <a href='/academia/glossario/seed-phrase' >seed phrase</a>, possivelmente não conseguirá mais conectar-se em sua Wallet. Mas também se tem pontos positivos em relação à segurança, já que seu dinheiro está sob seu domínio, e não de terceiros, você é seu próprio centralizador, reduzindo riscos de empresas mal-intencionadas tomarem seu dinheiro.</p><br><p class='article-text'>É possível encontrar os serviços antes mencionados para que suas moedas rendam também, utilizando de plataformas de <a href='/academia/glossario/decentralized-finance-defi' >finanças descentralizadas (DeFi)</a>. Essas plataformas recebem suas moedas, e oferecem serviços para que você possa receber retornos através de <a href='/academia/glossario/smart-contracts' >Smart Contracts</a>. Mas com isso, suas moedas não estão mais em sua Wallet, por isso deve se atentar e escolher plataformas confiáveis.</p><br><br><p class='article-text'><span class='detailSpan'>>></span> <strong>Existem diversas Wallets disponíveis e que funcionam de formas diferentes, sendo separadas em 2 tipos principais.</strong>  <span class='detailSpan'> &lt&lt </span> <br><br></p><p class='article-text' id='hotWallet'><strong>Hot Wallet</strong> </p><br><p class='article-text'>Carteiras que são conectadas a internet, geralmente têm seu acesso através de um aplicativo, site, ou extensão de um navegador, e permite ao usuário checar o balanço, realizar e receber transações e algumas até possibilitam o Swap dentro da própria carteira. Por serem digitais, e estarem conectadas a internet, são mais vulneráveis a ataques de <a href='/academia/glossario/hacker' >hackers</a>, porém têm uma usabilidade mais dinâmica e são mais convenientes para o uso do dia-a-dia.</p><br><br><p class='article-text' id='coldWallet'><strong>Cold Wallet</strong> </p><br><p class='article-text'>Já as Cold Wallets não possuem conexão com a internet, limitando a <a href='/academia/glossario/superficie-de-ataque' >superfície de ataque</a> de hackers a quase zero, e num geral tendem a ser muito mais seguras que as Hot Wallets. Contudo, sua usabilidade é menos intuitiva. Geralmente são através de equipamentos físicos, as Hardware Wallet (Hard Wallet) o que faz com que para uma transação de criptomoedas (mesmo que seja digital) ocorra, seja necessário o contato com um item físico.</p>",

        "<h2 id='capitulo4' class='article-header'>Capítulo 4 <br><small>Escalabilidade, ETH 2.0 e o futuro da Ethereum</small></h2><p class='article-text'> Conteúdos:<ul class='chapterSection'><li><span>-</span><a href='#oQueEEscalabilidade'><h4 class='chapter'>O que é Escalabilidade?</h4></a></li><li><span>-</span><a href='#escalabilidadeNaEthereum'><h4 class='chapter'>Escalabilidade na Ethereum</h4></a></li><li><span>-</span><a href='#oTrilemaDasRedesBlockchain'><h4 class='chapter'>O Trilema da Redes Blockchain</h4></a></li><li><span>-</span><a href='#transacoesNaEthereum'><h4 class='chapter'>Transações na Ethereum</h4></a></li><li><span>-</span><a href='#ethereum20'><h4 class='chapter'>Ethereum 2.0</h4></a></li><li><span>-</span><a href='#oQueEEthereumPlasma'><h4 class='chapter'>O que é Ethereum Plasma?</h4></a></li><li><span>-</span><a href='#oQueSaoEthereumRollups'><h4 class='chapter'>O que são Ethereum Rollups?</h4></a></li><li><span>-</span><a href='#oQueEEthereumProofOfStake'><h4 class='chapter'>O que é Ethereum Proof of Stake (PoS)?</h4></a></li><li><span>-</span><a href='#comoFuncionaOStakingDeEthereum'><h4 class='chapter'>Como funciona o Staking de Ethereum?</h4></a></li><li><span>-</span><a href='#quantosTokensPrecisoAdicionarEmStakeParaMeTornarUmValidadorDaEthereum?'><h4 class='chapter'>Quantos tokens preciso adicionar em Stake para me tornar um validador da Ethereum?</h4></a></li><li><span>-</span><a href='#quantoEuReceboAoFazerOStakeNaEthereum'><h4 class='chapter'>Quanto eu recebo ao fazer o Stake na Ethereum?</h4></a></li><li><span>-</span><a href='#quantoTempoMeusETHFicamEmStake'><h4 class='chapter'>Quanto tempo meus ETH ficam em Stake?</h4></a></li><li><span>-</span><a href='#quaisSaoOsRiscosDeFazerStakeNaEthereum'><h4 class='chapter'>Quais são os riscos de fazer Stake na Ethereum?</h4></a></li></ul></p>",   

        "<h2 class='article-header' id='oQueEEscalabilidade'>O que é Escalabilidade?</h2><p class='article-text'>Escalabilidade é um termo para definir o potencial de crescimento de algum projeto, produto ou serviço. Em computação, pode-se melhorar os servidores para que aguente uma demanda maior de usuários, tornando-se assim mais escalável.</p><br><p class='article-text'>No âmbito de <a href='/academia/glossario/criptomoedas' >criptomoedas</a> e Blockchain, escalabilidade se refere à habilidade de suportar um grande número de usuários, e o como ela pode ser aprimorada para aceitar mais usuários. A entrada de novos usuários significa mais transações a serem incluídas na <a href='/academia/glossario/blockchain' >Blockchain</a>, e a escalabilidade da rede, determina se será possível manter um alto número de usuários, com transações rápidas e baratas.</p>",

        "<h2 class='article-header' id='escalabilidadeNaEthereum'>Escalabilidade na Ethereum</h2><p class='article-text'>Usuários da Ethereum acreditam que o futuro da internet será construído sobre o protocolo da Ethereum ou outros projetos similares, a chamada Web3 busca trazer um ambiente digital <a href='/academia/glossario/descentralizado' >descentralizado</a> com o mínimo de intermediários. Aplicações e sistemas serão caracterizados pela segurança e privacidade, dados e itens digitais passarão a ser de posse verdadeira do usuário e não de uma empresa centralizadora. Esse ambiente será construído em cima de protocolos que utilizam de <a href='/academia/glossario/smart-contracts' >Smart Contracts</a> para realizar suas operações, e terão o poder computacional dividido entre todos os usuários da rede.</p><br><p class='article-text'>Para que isso seja possível, a Ethereum deve aumentar o número de transações que podem ser processadas sem que tenha impactos na rede e na experiência descentralizada do usuário. Diferente do <a href='/academia/glossario/bitcoin' >Bitcoin</a> a Ethereum não tem um limite de transações por <a href='/academia/glossario/bloco' >bloco</a>, mas aplica um mecanismo de limitar a quantidade de Gas que cada bloco aceita.</p><br><p class='article-text'>Por exemplo, caso o bloco aceite 10.000 <a href='/academia/glossario/gwei' >Gwei</a> como limite de Gas, e duas transações com o Gas limit de 5.000 Gwei cada serem solicitadas, as demais transações serão incluídas em um próximo bloco, e com isso se tem dois problemas, ou o usuário deve aguardar o próximo bloco para que sua transação aconteça ou deverá pagar um valor superior a 5.000 Gwei para que sua transação ocorra antes.</p><br><p class='article-text'>Esse mecanismo diminui a escalabilidade do projeto, e em uma rede com muitos usuários, refletirá em um acréscimo tanto na taxa de <a href='/academia/glossario/gas' >Gas</a>  quanto no tempo de uma transação ser efetuada.</p><br><p class='article-text'>No momento da escrita desse artigo a quantidade alvo de Gas aceito por cada bloco na <a href='/academia/glossario/blockchain' >Blockchain</a> da Ethereum é de 15 milhões de Gwei, podendo chegar até um máximo de 30 milhões de Gwei. Caso a quantidade de Gas/Bloco se mantenha superior ao limite, a taxa de Gas mínima será aumentada exponencialmente, buscando o equilíbrio desses valores.</p><br><p class='article-text'>Aumentar a quantidade limite de Gas aceito em cada bloco pode parecer a solução dos problemas de escalabilidade da Ethereum. Com um espaço maior para Gas, mais transações poderão ser incluídas no mesmo bloco, trazendo transações mais rápidas para os usuários. Porém batemos com o conceito do Trilema das Redes Blockchain descrito pelo próprio criador da Ethereum, Vitalik Buterin.</p>",

        "<h2 class='article-header' id='oTrilemaDasRedesBlockchain'>O Trilema da Redes Blockchain</h2><p class='article-text'>Para que uma rede Blockchain se mantenha com seus princípios, são necessários que 3 pontos estejam alinhados e em equilíbrio, são eles:</p><br><ul><li><p class='article-text'><strong>- Escalabilidade</strong></p></li><li><p class='article-text'><strong>- Segurança</strong></p></li><li><p class='article-text'><strong>- Descentralização</strong></p></li></ul><br><br><p class='article-text'>O trilema das redes blockchain, define que caso opte por otimizar dois desses pontos, o terceiro ficará em falta, resultando numa quebra dos princípios da Blockchain. </p><br><p class='article-text'>Pensando no Ethereum e no Bitcoin como exemplo, que priorizam a <strong>Segurança e Descentralização</strong> tem seu algoritmo de <a href='/academia/glossario/consenso' >consenso</a> programado de forma que garante a segurança nas transações, mas ao mesmo tempo reflete em uma menor Escalabilidade. Com diversos <a href='/academia/glossario/node' >nodes</a> recebendo e validando transações, sua rede se torna mais lenta e com taxas superiores a alternativas centralizadas.</p><br><p class='article-text'>Caso o limite de transações por <a href='/academia/glossario/bloco' >bloco</a> aumente a rede terá uma maior Escalabilidade, porém terá uma menor descentralização. Isso se dá, pois com mais transações por bloco, o bloco será maior e demandará de um maior poder computacional para que os blocos sejam validados e armazenados pelos nodes. </p><br><p class='article-text'>Com isso, nodes pequenos deixarão a rede que ao longo do tempo terá apenas uma fração de nodes com poder computacional altíssimo, tornando-se uma rede mais centralizada. Você alcançará uma rede com <strong>Escalabilidade e Segurança</strong>, porém com uma menor descentralização. </p><br><p class='article-text'>Por fim, em uma rede que otimiza a <strong>Escalabilidade e Descentralização</strong>, terá uma rede rápida e com transações baratas, porém qualquer um poderá ser um <a href='/academia/glossario/validador' >validador</a>, o que pode trazer problemas ao mecanismo de consenso, tornando-a insegura.</p>",

        "<h2 class='article-header' id='transacoesNaEthereum'>Transações na Ethereum</h2><p class='article-text'>Ethereum tem o objetivo de se tornar um “computador global”, mas a quantidade de transações que realiza por segundo não condiz com seus planos. Nos últimos anos a Ethereum se manteve em uma taxa surpreendentemente baixa de dez <a href='/academia/glossario/transacoes-por-segundo-tps' >transações por segundo TPS</a>.</p><br><p class='article-text'>Soluções para o problema de escalabilidade da Ethereum já estão em seu <a href='/academia/glossario/roadmap' >roadmap</a>. Uma solução que está em desenvolvimento é o <a href='/academia/glossario/ethereum-plasma' >Ethereum Plasma</a> que busca trazer melhorias na eficiência da Ethereum, mas não se limita a ela, tendo sua técnica aplicada também em outras Blockchains.</p>",
            
        "<h2 class='article-header' id='ethereum20'>Ethereum 2.0</h2><p class='article-text'>Apesar do potencial da Ethereum de ser um computador global que suporta um novo sistema financeiro, existem limitações que precisam ser tratadas, sendo a escalabilidade da rede uma delas. Para se tornar um sistema financeiro inovador é preciso ser capaz de processar muito mais do que 10 <a href='/academia/glossario/transacoes-por-segundo-tps' >transações por segundo</a>, e esse é um problema que desafia os desenvolvedores da Ethereum a anos.</p><br><p class='article-text'>É também preciso definir limitações para manter a rede suficientemente <a href='/academia/glossario/descentralizado' >descentralizada</a>. Quanto mais alto os requisitos para operar um <a href='/academia/glossario/node' >node</a>, menos nodes serão participantes na rede, tornando-a cada vez mais centralizada. Então aumentar o numero de transações que a Ethereum pode processar, por mais que seja fundamental para a escalabilidade, é um perigo para a integridade do sistema.</p><br><p class='article-text'>Outro problema da Ethereum (e de outras criptomoedas que utilizam de <a href='/academia/glossario/proof-of-work-pow' >Proof of Work</a>) é a demanda por poder computacional. Para adicionar novos blocos em uma blockchain que utiliza de Proof of Work, é necessário fazer a <a href='/academia/glossario/mineracao' >mineração</a>, um processo de computação de dados que consome uma grande quantidade de energia.</p><br><p class='article-text'>Para solucionar os problemas citados, uma proposta de melhoria conhecida como Ethereum 2.0 ou (Eth2) está sendo desenvolvida, está que por sua vez, trará mudanças na eficiência da rede, com uma maior escalabilidade e a migração de <a href='/academia/glossario/proof-of-work-pow'>Proof of Work</a> para <a href='/academia/glossario/proof-of-stake-pos' >Proof of Stake</a>.</p>",

        "<h2 class='article-header' id='oQueEEthereumPlasma'>O que é Ethereum Plasma?</h2><p class='article-text'><a href='/academia/glossario/ethereum-plasma' >Ethereum Plasma</a> é uma solução que busca trazer escalabilidade <a href='/academia/glossario/off-chain' >Off-Chain</a> para a Ethereum. Baseia-se em utilizar de redes secundárias que operam de forma independente (similares às <a href='/academia/glossario/side-chain' >Sidechains</a>), mas que permanecem conectadas à Blockchain principal da Ethereum. Essa solução busca reduzir a quantidade de dados que os nodes armazenam na rede principal assim tendo uma maior escalabilidade.</p><br><p class='article-text'>As “redes secundárias” têm suas funcionalidades definidas em um único <a href='/academia/glossario/smart-contracts' >Smart Contract</a> na <a href='/academia/glossario/blockchain' >Blockchain</a> principal, com isso, desenvolvedores tornam-se livres para criar aplicações nessas redes de forma mais barata do que armazenar e executar operações na rede principal.</p><br>",

        "<h2 class='article-header' id='oQueSaoEthereumRollups'>O que são Ethereum Rollups?</h2><p class='article-text'>Similares ao Plasma, Rollups também buscam trazer escalabilidade ao mover as transações para fora da Blockchain principal.</p><br><p class='article-text'>Em Rollups todos os fundos dessa “rede secundária” e uma comprovação criptografada do atual estado da rede são mantidos dentro de um único <a href='/academia/glossario/smart-contracts' >Smart Contract</a> na Blockchain principal. O usuário dessa rede secundária, na qual fez o registro do contrato na rede principal, certifica de que apenas transações validadas passem para o contrato. Já que as redes secundárias permanecem <a href='/academia/glossario/off-chain' >off-chain</a>, não é necessário armazenar dados na blockchain.</p><br><p class='article-text'>A principal diferença de Rollup e Plasma é a forma em que as transações são passadas para a rede princial. Em rollups, um grande número de transações são agrupadas e enviadas para a Blockchain como um tipo especial de bloco, o Rollup Block.</p><br><p class='article-text'>Rollups são dividos em dois tipos: <strong>Optimistic e ZK Rollup</strong>, e ambos garantem somente o envio de transações validadas para a rede principal, porém de maneiras diferentes.</p><br><p class='article-text'>ZK Rollups: Envia transações utilizando um modelo de verificação chamado <a href='/academia/glossario/zero-knowledge-proofs' >Zero-Knowledge Proof</a>, esse modelo, garante que duas partes possam provar uma a outra que ambas possuem uma informação específica, mas sem revelar a informação em si. No caso de ZK Rollups, essa informação é a transação validada que é enviada para a rede principal.</p><br><p class='article-text'>Uma vantagem ao utilizar ZK Rollups é a velocidade na transação que ocorre quase que instantaneamente além de possuir taxas baixíssimas e grande segurança.</p><br><p class='article-text'>Optimistic Rollups: Permite que <a href='/academia/glossario/smart-contracts' >Smart Contracts</a> sejam executados nas redes secundárias, trazendo maior flexibilidade porém sacrificando a escalabilidade. Optimistic Rollups utilizam de uma máquina virtual chamada de Optimistic Virtual Machine (OVM) para executar esses contratos, entretanto não possui um sistema de verificação para provar que a transação enviada para a rede principal é correta. Para mitigar o risco de transações invalidadas serem enviadas, existe um atraso em sua operação, para que usuários possam rejeitar blocos inválidos caso sejam enviados para a rede principal.</p>",

        "<h2 class='article-header' id='oQueEEthereumProofOfStake'>O que é Ethereum Proof of Stake (PoS)?</h2><p class='article-text'><a href='/academia/glossario/proof-of-stake-pos' >Proof of Stake (PoS)</a> é uma forma de validar blocos que busca solucionar problemas do convencional <a href='/academia/glossario/proof-of-work-pow' >Proof of Work (PoW)</a>. Diferente do PoW, no Proof of Stake ao invés de utilizar do poder computacional para minerar blocos, cada node (validador) é selecionado aleatoriamente para validar um bloco num processo chamado Mint, caso a validação seja correta o node receberá todas as taxas de transferência do bloco e a <a href='/academia/glossario/block-reward' >recompensa do bloco</a>, dependendo de cada <a href='/academia/glossario/protocolo' >protocolo</a>.</p><br><p class='article-text'>Um dos principais benefícios do Proof of Stake é no âmbito ambiental, já que não demanda de um enorme poder computacional para validar blocos, o consumo de energia para manter a rede ativa é minimizado.</p><br><p class='article-text'>Para o Ethereum a migração de Proof of Work para Proof of Stake já está em desenvolvimento, e tende a ser implantado junto com o Ethereum 2.0 num processo de melhoria chamado Ethereum Casper.</p>",

        "<h2 class='article-header' id='comoFuncionaOStakingDeEthereum'>Como funciona o Staking de Ethereum?</h2><p class='article-text'>Nos protocolos <a href='/academia/glossario/proof-of-work-pow' >Proof of Work</a>, quem mantém a segurança da rede são os <a href='/academia/glossario/mineradores' >mineradores</a>, que disponibilizam poder computacional para validar as operações. Por passar por todos os nodes em busca de encontrar um <a href='/academia/glossario/consenso' >consenso</a> dos blocos validados, roubar nesse jogo será um desperdício de tempo e de energia do minerador, e pode levá-lo a diminuir suas recompensas.</p><br><p class='article-text'>No <a href='/academia/glossario/proof-of-stake-pos' >Proof of Stake</a> é um pouco diferente, ao invés de possuir o risco de diminuir a recompensa caso tenha uma conduta desonesta, o risco está em perder seus ativos. No PoS, validadores precisam adicionar em Stake uma certa quantidade de <a href='/academia/glossario/tokens' >tokens</a> para serem aptos a realizar validações, esses tokens serão lentamente perdidos caso o <a href='/academia/glossario/validador' >validador</a> tente roubar, ou permaneça offline, não realizando as validações que deveria estar fazendo.</p>",
        
        "<h2 class='article-header' id='quantosTokensPrecisoAdicionarEmStakeParaMeTornarUmValidadorDaEthereum?'>Quantos tokens preciso adicionar em Stake para me tornar um validador da Ethereum?</h2><p class='article-text'>São necessários no mínimo 32 ETH em <a href='/academia/glossario/staking' >Stake</a> para ser um validador, e essa quantidade ser alta traz uma segurança maior para a rede, pois isso torna muito caro para realizar <a href='/academia/glossario/ataque-de-51' >ataques de 51%</a>.</p>",

        "<h2 class='article-header' id='quantoEuReceboAoFazerOStakeNaEthereum'>Quanto eu recebo ao fazer o Stake na Ethereum?</h2><p class='article-text'>Esse valor varia bastante e leva em consideração uma série de fatores, como a atividade na rede, a quantidade que você alocou em <a href='/academia/glossario/staking' >Stake</a>, e a quantidade total que têm alocado em Stake na rede. Uma estimativa no momento em que escrevemos esse artigo é um retorno aproximado de 6% ao ano, mas é apenas uma estimativa e possivelmente irá variar no futuro.</p>",

        "<h2 class='article-header' id='quantoTempoMeusETHFicamEmStake'>Quanto tempo meus ETH ficam em Stake?</h2><p class='article-text'>Assim que seus Ether estiverem em Stake, você estará atuando como <a href='/academia/glossario/validador' >validador</a> e estará apto a receber recompensas. Caso deseje sacar seus tokens de volta, você entrará para uma fila de saque, que varia conforme a quantidade de validadores sacando no mesmo momento. Caso não tenha a fila o tempo mínimo de saque são 18 horas. Isso ocorre para proteger que muitas pessoas retirem seus tokens ao mesmo tempo, pois causaria um colapso na rede.</p>",

        "<h2 class='article-header' id='quaisSaoOsRiscosDeFazerStakeNaEthereum'>Quais são os riscos de fazer Stake na Ethereum?</h2><p class='article-text'>Por ser um validador, sua missão e manter a rede segura e ativa, para em troca, receber recompensas pelo seu trabalho, contudo deve se levar em consideração alguns riscos.</p><br><p class='article-text'>Caso seu <a href='/academia/glossario/node' >node</a> de validação permaneça muito tempo offline, sua parcela em Stake começará a ser consumida, e poderá perder grande parte do valor alocado. Caso a quantidade em <a href='/academia/glossario/staking' >Stake</a> diminua abaixo de 16 ETH, você será removido do grupo de validadores.</p><br>",

        "<h2 id='capitulo5' class='article-header'>Capítulo 5<br><small>Ethereum e Finanças Descentralizadas (DeFi)</small></h2><p class='article-text'> Conteúdos:<ul class='chapterSection'><li><span>-</span><a href='#oQueSaoFinancasDescentralizadas'><h3 class='chapter'>O que são Finanças Descentralizadas (DeFi)?</h3></a></li><li><span>-</span><a href='#quaisOsUsosDasFinancasDescentralizadas'><h3 class='chapter'>Quais os usos das Finanças Descentralizadas (DeFi)?</h3></a></li><li><span>-</span><a href='#quaisOsTiposDeAplicacoesDeFi'><h3 class='chapter'>Quais os tipos de aplicações DeFi?</h3></a></li><li><span>-</span><a href='#exchangesDescentralizadas'><h3 class='chapter'>Exchanges Descentralizadas (DEX)</h3></a></li><li><span>-</span><a href='#exchangesCentralizadasXExchangesDescentralizadas'><h3 class='chapter'>Exchanges Centralizadas (CEX) x Exchanges Descentralizadas (DEX)</h3></a></li></ul></p>",  

        "<h2 class='article-header' id='oQueSaoFinancasDescentralizadas'>O que são Finanças Descentralizadas (DeFi)?</h2><p class='article-text'><a href='/academia/glossario/decentralized-finance-defi' >Finanças Descentralizadas</a>, ou DeFi, são aplicações financeiras que buscam não possuem um centralizador, como um banco por exemplo. Plataformas <a href='/academia/glossario/decentralized-finance-defi' >DeFi</a> são construídas em <a href='/academia/glossario/blockchain' >blockchains</a> com códigos <a href='/academia/glossario/open-source-software' >open-source</a>, fazendo com que qualquer um possa acessar. Essas plataformas têm grande importância no objetivo das criptomoedas de ser um sistema financeiro global descentralizado.</p><br><p class='article-text'>As plataformas DeFi, permitem aos usuários interagirem entre si usando redes <a href='/academia/glossario/peer-to-peer-p2p' >peer-to-peer (P2P)</a> e também acessar as funcionalidades da plataforma usando <a href='/academia/glossario/smart-contracts' >Smart Contracts</a>. Um ponto positivo de DeFi é que durante todo o processo, o usuário mantém a posse de seus ativos.</p><br><p class='article-text'><a href='/academia/glossario/decentralized-finance-defi' >Finanças Descentralizadas (DeFi)</a> é um movimento que busca se tornar um novo sistema financeiro, livre de limitações centralizadas, de forma a permitir ao usuário a posse de seu ativo durante todo o tempo, e que as trocas, aconteçam de pessoa para pessoa (P2P). Existem diversas plataformas de DeFi disponíveis, sendo a maioria delas desenvolvida na Ethereum.</p><br>",

        "<h2 class='article-header' id='quaisOsUsosDasFinancasDescentralizadas'>Quais os usos das Finanças Descentralizadas (DeFi)?</h2><p class='article-text'>A idéia principal das <a href='/academia/glossario/criptomoedas' >criptomoedas</a> é que trocas de valor possam ocorrer sem um <a href='/academia/glossario/centralizado' >centralizador</a> coordenando essas operações, um exemplo disso é o <a href='/academia/glossario/bitcoin' >Bitcoin</a>. DeFi busca usar esse conceito para criar <a href='/academia/glossario/aplicacao-descentralizada-dapp' >aplicações descentralizadas</a> que dispensam intermediários e centralizadores coordenando as operações, eliminando pontos únicos de falha.</p><br><p class='article-text'>Uma das grandes vantagens do DeFi é o fácil acesso por qualquer um, basta ter acesso à internet. Com isso, bilhões de pessoas que não possuem acesso a serviços financeiros específicos podem utilizar as plataformas <a href='/academia/glossario/decentralized-finance-defi' >DeFi</a>. Muitas pessoas vivem sem utilizar do sistema financeiro tradicional, trazendo incerteza para suas finanças. DeFi tem como alvo esse público.</p><br>",

        "<h2 class='article-header' id='quaisOsTiposDeAplicacoesDeFi'>Quais os tipos de aplicações DeFi?</h2><p class='article-text'>Com o ecossistema de DeFi expandindo, existem diversas opções de serviços e funcionalidades disponíveis. Um dos usos mais populares de <a href='/academia/glossario/decentralized-finance-defi' >Finanças Descentralizadas (DeFi)</a> são as Stablecoins, moedas lastreadas a ativos do mundo real. <a href='/academia/glossario/stablecoins' >Stablecoins</a> são tokens que operam sobre redes <a href='/academia/glossario/blockchain' >blockchain</a> (Tornando-os facilmente trocáveis) e que acompanham o valor de algum ativo, como <a href='/academia/glossario/moeda-fiduciaria' >moeda fiduciária</a>, índice ou commodities. Por exemplo, o token <a href='../../cryptocurrencies/usd-coin/usd-coin.html' >USDC</a> é lastreado ao valor do Dólar Americano (USD).</p><br><p class='article-text'>Outras aplicações muito populares são as plataformas de empréstimo de criptomoedas, os Lending Protocol. Existem diversas plataformas que permitem tanto emprestar suas moedas para receber um retorno percentual sobre isso, ou pegar moedas emprestadas sobre uma taxa de juros. Tudo isso ocorrendo de forma <a href='/academia/glossario/peer-to-peer-p2p' >peer-to-peer (P2P)</a>.</p><br><p class='article-text'>Existem diversos serviços quando se trata de <a href='/academia/glossario/decentralized-finance-defi' >DeFi</a>. Pools de Liquidez, <a href='/academia/glossario/yield-farming' >Yield Farming</a>, e <a href='/academia/glossario/staking' >Staking</a> são alguns dos modelo de retorno passivo porém o mercado não se limita a isso.</p><br><p class='article-text'>Com a expansão dos <a href='/academia/glossario/nft-tokens-nao-fungiveis' >NFTs</a>, e com as plataformas de Marketplaces Descentralizados é possível comprar e vender esses colecionáveis e outros itens digitais. </p><br><p class='article-text'>Com as plataformas de Swaping é possível criar pares de liquidez de praticamente qualquer coisa que tenha valor. Diversas plataformas oferecem acesso à <a href='/academia/glossario/derivativos' >derivativos</a> de ações, e índices do mundo real, e muito mais.</p><br>",

        "<h2 class='article-header' id='exchangesDescentralizadas'>Exchanges Descentralizadas (DEX)</h2><p class='article-text'><a href='/academia/glossario/exchange' >Exchanges</a> são empresas que permitem a compra e venda de criptomoedas e outros ativos, essas plataformas geralmente recebem seu depósito que permanece em <a href='/academia/glossario/custodia' >custódia</a> para realizar suas operações. Com o universo ecossistema do DeFi, as <a href='/academia/glossario/decentralized-exchange-dex' >Exchanges Descentralizadas (DEX)</a> buscam realizar os mesmos serviços, porém sem ter uma empresa coordenando as operações.</p><br><p class='article-text'>Nas Exchanges Descentralizadas as trocas acontecem diretamente entre as carteiras dos usuários, graças ao poder dos <a href='/academia/glossario/smart-contracts' >Smart Contracts</a>. Eliminando riscos de empresas mal intencionadas, ou de ataque de <a href='/academia/glossario/hacker' >hackers</a> nessas empresas.</p><br><p class='article-text'>Alguns exemplos de Exchanges Descentralizadas que são desenvolvidas na Ethereum são a <a href='/criptomoedas/uniswap' >Uniswap</a>, <a href='/criptomoedas/kyber-network-crystal-v2' >Kyber Network</a> e a IDEX.</p><br>",

        "<h2 class='article-header' id='exchangesCentralizadasXExchangesDescentralizadas'>Exchanges Centralizadas (CEX) x Exchanges Descentralizadas (DEX)</h2><p class='article-text'>Nas  Exchanges Centralizadas (CEX) a troca ocorre com um <a href='/academia/glossario/centralizado' >centralizador</a> coordenando a operação.</p><br><p class='article-text'><strong>João</strong> <span class='detailSpan'>>></span> <strong>15 Token A</strong> <span class='detailSpan'>>></span> <b class='detailSpan'>Exchange</strong> <span class='detailSpan'>>></span> <strong>15 Token A</strong> <span class='detailSpan'>>></span> <strong> Bruna</strong> <br><br><strong>Bruna</strong> <span class='detailSpan'>>></span> <strong>15 Token B</strong> <span class='detailSpan'>>></span> <b class='detailSpan'>Exchange</strong> <span class='detailSpan'>>></span> <strong>15 Token B</strong> <span class='detailSpan'>>></span> <strong> João</strong> <br></p><br><br><br><p class='article-text'>Já nas <a href='/academia/glossario/decentralized-exchange-dex' >Exchanges Descentralizadas (DEX)</a> a troca ocorre diretamente entre usuários.</p><br><p class='article-text'><strong>João</strong> <span class='detailSpan'>>></span> <strong>15 Token A</strong> <span class='detailSpan'>>></span> <strong> Bruna</strong> <br><br><strong>Bruna</strong> <span class='detailSpan'>>></span> <strong>15 Token B</strong> <span class='detailSpan'>>></span> <strong> João</strong> <br></p><br><p class='article-text'>Para que usuários possam realizar trocas nas CEX, é preciso depositar seus fundos na plataforma, que tem a função de coordenar e garantir essas trocas. Já nas <a href='/academia/glossario/decentralized-exchange-dex' >DEX</a> a troca é feita diretamente da sua <a href='/academia/glossario/wallet' >Wallet</a>, e a garantia é feita através de <a href='/academia/glossario/smart-contracts' >Smart Contracts</a>.</p><br><p class='article-text'>Cada tipo de <a href='/academia/glossario/exchange' >Exchange</a> possui suas vantagens e desvantagens, pelas exchanges centralizadas possuírem uma base de usuário muito maior, grande parte do <a href='/academia/glossario/volume' >volume</a> e <a href='/academia/glossario/liquidez' >liquidez</a> do mercado está nas plataformas centralizadas. Já as <a href='/academia/glossario/decentralized-exchange-dex' >DEX</a> permitem que o usuário mantenha seus ativos em sua posse durante toda a troca.</p><br><p class='article-text'>Quer saber mais sobre Finanças Descentralizadas, separamos uma seção especial direcionado especificamente para DeFi. <a href='/guias/defi'>Acesse em PIC | DeFi.</a></p><br>",

        "<h2 id='capitulo6' class='article-header'>Capítulo 6<br><small>Participando na Rede Ethereum</small></h2><p class='article-text'> Conteúdos:<ul class='chapterSection'><li><span>-</span><a href='#oQueSaoNodesDaEthereum'><h3 class='chapter'>O que são Nodes da Ethereum?</h3></a></li><li><span>-</span><a href='#comoFuncionaUmNodeDaEthereum'><h3 class='chapter'>Como funciona um Node da Ethereum?</h3></a></li><li><span>-</span><a href='#ethereumFullNodes'><h3 class='chapter'>Ethereum Full Nodes</h3></a></li><li><span>-</span><a href='#ethereumLightNodes'><h3 class='chapter'>Ethereum Light Nodes</h3></a></li><li><span>-</span><a href='#ethereumMiningNodes'><h3 class='chapter'>Ethereum Mining Nodes</h3></a></li><li><span>-</span><a href='#comoRodarUmNodeDaEthereum'><h3 class='chapter'>Como rodar um Node da Ethereum?</h3></a></li><li><span>-</span><a href='#comoMinerarNaEthereum'><h3 class='chapter'>Como minerar na Ethereum?</h3></a></li><li><span>-</span><a href='#quemDesenvolveOSoftwareDaEthereum'><h3 class='chapter'>Quem desenvolve o software da Ethereum?</h3></a></li><li><span>-</span><a href='#oQueESolidity'><h3 class='chapter'>O que é solidity?</h3></a></li></ul></p>",   
        
        "<h2 class='article-header' id='oQueSaoNodesDaEthereum'>O que são Nodes da Ethereum?</h2><p class='article-text'><a href='/academia/glossario/node' >Nodes</a> são programas que de alguma forma interagem com a Ethereum, sejam eles aplicativos simples de celular como <a href='/academia/glossario/wallet' >Wallets</a>, ou sistemas complexos de computadores.</p><br><p class='article-text'><span class='detailSpan'>>></span> <strong>Existem diferentes tipos de nodes, mas todos servem como um ponto de comunicação na rede Ethereum.</strong>  <span class='detailSpan'> &lt&lt </span></p><br>", 

        "<h2 class='article-header' id='comoFuncionaUmNodeDaEthereum'>Como funciona um Node da Ethereum?</h2><p class='article-text'>Ethereum não possui um sistema único para ser utilizado como <a href='/academia/glossario/node'>Node</a>. O ecossistema do <a href='/academia/glossario/bitcoin' >Bitcoin</a>, por exemplo, possui o Bitcoin Core, que serve como Node primário. Já na Ethereum existem diversos programas únicos, mas compatíveis. Alguns exemplos de nodes da Ethereum são o Geth e o Parity.</p><br>",

        "<h2 class='article-header' id='ethereumFullNodes'>Ethereum Full Nodes</h2><p class='article-text'>Utilizando de sistemas como os mencionados anteriormente é possível rodar Full Nodes, podendo assim interagir com a rede da Ethereum, e validar informações da <a href='/academia/glossario/blockchain' >Blockhain</a> de forma independente.</p><br><p class='article-text'>O sistema baixa <a href='/academia/glossario/bloco' >blocos</a> de outro nodes, e verificará se as transações incluídas nos blocos são corretas. Para garantir que a informação que você receba seja a mesma que a de outros nodes, o sistema também executará todos os <a href='/academia/glossario/smart-contracts' >Smart Contracts</a> que foram acionados. Com isso, todos os nodes deverão ter uma cópia idêntica da <a href='/academia/glossario/blockchain' >Blockchain</a>.</p><br> <p class='article-text'>Full Nodes são de extrema importância para a Ethereum, e é fundamental ter diversos nodes espalhados ao redor do mundo para manter a descentralização na rede.</p><br>",

        "<h2 class='article-header' id='ethereumLightNodes'>Ethereum Light Nodes</h2><p class='article-text'>Apesar da importância dos Full Nodes para a rede da Ethereum, manter um Full Node demanda muitos recursos, o que o torna inviável para muitas pessoas. Light Nodes é uma opção mais viável (porém limitada) para aqueles que não são capazes de rodar Full Nodes.</p><br><p class='article-text'>Light Nodes utilizam menos recursos da máquina e menos espaço, o que possibilita que sejam executados em quase qualquer máquina, sejam elas aparelhos celulares ou laptops. Como mencionado anteriormente, Light Nodes são limitados, e dependem de full nodes para obter algumas informações importantes.</p><br> <p class='article-text'>Light Nodes são muito utilizados para receber e enviar pagamentos, e é utilizado principalmente por usuários comuns, comerciantes, e prestadores de serviço, em casos na qual rodar um Full Node trará um custo muito elevado, ou será desnecessário.</p><br>",

        "<h2 class='article-header' id='ethereumMiningNodes'>Ethereum Mining Nodes</h2><p class='article-text'>Mining Nodes, também conhecidos como Nodes de Mineração, podem ser tanto Full Nodes quanto Light Nodes. Mesmo que possua o mesmo nome, Mining Nodes da Ethereum e Mining Nodes do <a href='./bitcoin-discover.html' >Bitcoin</a> são coisas diferentes.</p><br><p class='article-text'>Para minerar na Ethereum é preciso um alto poder computacional e isso envolve hardwares avançados. Uma pratica comum com relação a <a href='/academia/glossario/mineracao' >mineração</a> na Ethereum é a criação de Rigs de Mineração, um conjunto de várias <a href='/academia/glossario/graphical-processing-unit-gpu' >GPUs</a> conectadas para obter um alto <a href='/academia/glossario/hash-rate' >Hash Rate</a>.</p><br><p class='article-text'><span class='detailSpan'>>></span> <strong>Há duas formas de mineração: a mineração individual ou as pools de mineração.</strong><span class='detailSpan'> &lt&lt </span><br><br></p><br><p class='article-text'><strong>Mineração Individual:</strong> <a href='/academia/glossario/mineradores' >Mineradores</a> trabalham sozinho encontrar blocos corretos, caso obtenham sucesso a <a href='/academia/glossario/block-reward' >recompensa</a> fica somente para ele.</p><br><p class='article-text'><strong>Pools de Mineração:</strong> Conhecidas como Piscinas de Mineração, sistemas que juntam o Hash Power de diversos usuários para aumentar a chance de encontrar blocos corretos, porém caso tenham sucesso a <a href='/academia/glossario/block-reward' >recompensa</a> será dividida entre os membros da Pool.</p><br>",

        "<h2 class='article-header' id='comoRodarUmNodeDaEthereum'>Como rodar um Node da Ethereum?</h2><p class='article-text'>Um dos pontos fortes das <a href='/academia/glossario/blockchain' >Blockchains</a> é o fácil acesso. Isso quer dizer que qualquer pessoa pode rodar <a href='/academia/glossario/node' >Nodes</a> da Ethereum e começar a validar blocos e transações.</p><br><p class='article-text'>Assim como o <a href='./bitcoin-discover.html' >Bitcoin</a>, existem diversas empresas que oferecem sistemas prontos para serem executados de nodes da Ethereum. Caso deseje ter fácil acesso a nodes essa pode ser a melhor opção, porém essas empresas geralmente cobram taxas por esses serviços.</p><br> <p class='article-text'>A Ethereum possui diversos softwares para rodar nodes, podemos usar como exemplo os mencionados anteriormente, Geth e o Parity. Caso deseje rodar seu próprio node é importante se familiarizar com o setup de cada software.</p><br><p class='article-text'>Praticamente qualquer máquina é capaz de rodar Full Nodes, porém não é recomendado usar a sua máquina do dia-a-dia, já que pode torná-la lenta. Rodar seus próprios <a href='/academia/glossario/node' >nodes</a> é mais recomendado em máquinas que permanecerão ligadas o tempo todo, pois caso seu node fique offline, após ligar, pode levar um tempo considerável para sincronizar com a rede.</p><br>", 

        "<h2 class='article-header' id='comoMinerarNaEthereum'>Como minerar na Ethereum?</h2><p class='article-text'>Com a chegada do Ethereum 2.0 a Ethereum irá migrar de <a href='/academia/glossario/proof-of-work-pow' >Proof of Work</a> para <a href='/academia/glossario/proof-of-stake-pos' >Proof of Stake</a>, pensando nisso, investir em mineração na Ethereum pode não ser a melhor escolha para o longo-prazo. Com a mudança, <a href='/academia/glossario/mineradores' >mineradores</a> terão que migrar para outra rede ou vender seus equipamentos.</p><br><p class='article-text'>Mas caso ainda tenha intenções de participar da mineração será necessário hardwares específicos como <a href='/academia/glossario/graphical-processing-unit-gpu' >GPUs</a> ou máquinas <a href='/academia/glossario/application-specific-integrated-circuit-asic' >ASIC</a>. Caso deseje ter retornos significantes, criar uma Rig de mineração e ter acesso a eletricidade de baixo custo é uma boa opção. Será preciso também registrar uma <a href='/academia/glossario/wallet' >wallet</a> da Ethereum e configurar seu software de mineração. Minerar na Ethereum demanda tempo e investimento, então se deve analisar se segue viável participar como minerador.</p><br>",

        "<h2 class='article-header' id='quemDesenvolveOSoftwareDaEthereum'>Quem desenvolve o software da Ethereum?</h2><p class='article-text'>Assim como o Bitcoin, a Ethereum é um sistema <a href='/academia/glossario/open-source-software' >open-source</a>, ou seja, qualquer um pode participar no desenvolvimento do protocolo, ou criar aplicações descentralizadas que serão executadas sob a rede da Ethereum. Por ser a maior criptomoeda de primeira camada (Tirando o Bitcoin) também possui a maior comunidade de desenvolvedores quando se trata de <a href='/academia/glossario/blockchain' >blockchain</a>.</p><br>",

        "<h2 class='article-header' id='oQueESolidity'>O que é solidity?</h2><p class='article-text'><a href='/academia/glossario/smart-contracts' >Smart Contracts</a> já existem a um bom tempo, mas ao aplicar o conceito em <a href='/academia/glossario/blockchain' >Blockchain</a>, as possibilidades se expandiram.</p><br><p class='article-text'>Em 2014, Gavin Wood desenvolveu a <a href='/academia/glossario/solidity' >Solidity</a>, uma linguagem de programação que futuramente se tornaria a principal linguagem para o desenvolvimento de <a href='/academia/glossario/smart-contracts' >Smart Contracts</a> na Ethereum. Sua sintaxe lembra muito as linguagens já existente no mercado como, Java, JavaScript e C++.</p><br><p class='article-text'>Solidity tem o papel de possibilitar desenvolvedores a criarem códigos que podem ser interpretados como instruções pela <a href='/academia/glossario/ethereum-virtual-machine-evm'>Ethereum Virtual Machine (EVM)</a>. Solidity tem dominância entre as linguagens para desenvolvimento de Smart Contracts, mas não é a única, outro exemplo muito popular é a Vyper, uma linguagem na qual sua sintaxe lembra a Python.</p><br>"],
        "categories": ["blockchain", "ethereum"],
        "image": "ETHLogo.png",
        "date": "19/05/2022",
        "readTime": 40,
        "mainColor": "#4b5563",
        "secondaryColor": "#f1f5f9"
    },
    {
        "id": 6,
        "title": "Polkadot (DOT)",
        "url": "o-que-e-polkadot-dot",
        "contentTitle": "O que é Polkadot (DOT)?",
        "content": ["<p class='article-text'><strong>Polkadot busca subir o nível dos protocolos Blockchain ao ser capaz de conectar diversas redes em uma rede universal.</strong></p><br><p class='article-text'><strong>Com seu foco em construir uma Web3 conectada e descentralizada, Polkadot traz a idéia de poder ao usuário eliminando barreiras centralizadoras com o potencial de conexão entre um grande número de usuários do ecossistema de Blockchains.</strong></p>",
        
        "<h2 class='article-header'>Introdução</h2><p class='article-text'>Com o lançamento do <a href='/academia/glossario/bitcoin' >Bitcoin</a>, um projeto de criptomoeda construído por <a href='/academia/glossario/satoshi-nakamoto'  >Satoshi Nakamoto</a>, as Blockchains  tomaram notoriedade e passaram a ser implementadas na Web. Mas apesar do grande potencial das <a href='/academia/glossario/blockchain' >Blockchains</a> em se tornarem um novo marco na tecnologia, ainda existem muitos desafios, sendo a interoperabilidade entre Blockchains um deles.</p><br><p class='article-text'>A interoperabilidade de Blockchains permite que diferentes redes se conectem para trocar informações, o problema é que Blockchains individuais não são capazes de se conectar com outras.</p><br><p class='article-text'><strong>Blockchain A  <span class='detailSpan'>>></span> Envia e Recebe <span class='detailSpan'>&lt&lt</span> Blockchain A</strong></p><br><p class='article-text'><strong>Blockchain B<span class='detailSpan'>>></span> Envia e Recebe <span class='detailSpan'>&lt&lt</span> Blockchain B</strong> </p><br><p class='article-text'>Como solução para esse problema, desenvolvedores criaram o sistema de Bridge, que serve como uma ponte entre <a href='/academia/glossario/blockchain' ></a> Blockchains.</p><br><p class='article-text'>Permitir que uma Blockchain A se conecte com uma Blockchain B é fácil para sistemas de Bridge, o problema é quando se quer conectar centenas (ou milhares) de Blockchains entre si. A equipe da Polkadot em conjunto com a Web3 Foundation, buscam criar soluções de interoperabilidade, para possibilitar a conexão entre diversas redes.</p>",
        
        "<h2 class='article-header'>O que é Polkadot</h2><p class='article-text'>Polkadot é um protocolo <a href='/academia/glossario/open-source-software' >open-source</a> desenvolvido para trazer uma evolução no ambiente de Blockchains. Tendo seu conceito criado pelo co-fundador da <a href='./ethereum-discover.html' >Ethereum</a>, Gavin Wood, Polkadot traz soluções inovadoras de interoperabilidade, mantendo a segurança e <a href='/academia/glossario/escalabilidade' >escalabilidade</a>. Para que isso seja possível e ao mesmo tempo suporte a interoperabilidade desejada, toda uma infraestrutura deve ser criada.</p><br><p class='article-text'>O ecossistema da Polkadot traz como infraestrutura as Parachains (Parallel Blockchains), e a Relay Chain (Blockchain Principal). Ambas as partes podem trocar informações entre si e funciona com um sistema similar ao Ethereum Shard.</p><br><p class='article-text'>Desenvolvedores que desejam criar aplicações na Polkadot podem utilizar o protocolo Substrate, para criar criptomoedas e <a href='/academia/glossario/aplicacao-descentralizada-dapp' >aplicações descentralizadas (DApps)</a> nessas Parachains. Uma vez conectada à rede da Polkadot, as Parachains podem se comunicar entre si, tornando-as interoperáveis.</p><br><p class='article-text'>Com esse mecanismo, criar aplicações e produtos Cross-chain se torna muito mais fácil, e um ecossistema pouco visto antes, onde múltiplas <a href='/academia/glossario/blockchain' >Blockchains</a> transacionam informações em grande escala, pode se tornar mais comum.</p>",
        
        "<h2 class='article-header'>A Grande Idéia da Polkadot</h2><p class='article-text'>Polkadot busca criar um ecossistema completo, onde diversos projetos compartilham informações entre si, e usuários façam parte de vários desses projetos. Com a possibilidade de criar aplicações individuais com características únicas, diversos sistemas cada um com suas próprias funcionalidades existirão e serão conectados através da Relay Chain.</p><br><p class='article-text'><span class='detailSpan'>>> </span><strong>Imagine a Polkadot como uma cidade. Nessa cidade existe: cinemas, supermercados, praças, shoppings, etc.. </strong><span class='detailSpan'>&lt&lt</span></p><br><p class='article-text'><span class='detailSpan'>>> </span><strong>Cada um desses estabelecimentos seria uma Parachain e os moradores (no caso os usuários da Polkadot) utilizariam os serviços desses estabelecimentos.</strong><span class='detailSpan'>&lt&lt</span></p><br><p class='article-text'><span class='detailSpan'>>> </span><strong>Com o crescimento da rede, Aplicações Descentralizadas (DApps), <a href='/academia/glossario/decentralized-finance-defi'>Protocolos DeFi</a>, <a href='/academia/glossario/nft-tokens-nao-fungiveis' >Protocolos DeFi</a>, Marketplaces e outras plataformas existirão, todas conectas pela Blockchain principal.</strong><span class='detailSpan'>&lt&lt</span></p>",
        
        "<h2 class='article-header'>Vantagens da Polkadot</h2><p class='article-text'>Por natureza as <a href='/academia/glossario/blockchain' >Blockchains</a> possuem limitações para assegurar seus fundamentos, limitações essas, que atrapalham as Blockchains quando utilizadas em grande escala. Polkadot busca solucionar esse problemas, e oferece aos desenvolvedores a possibilidade de criar aplicações customizáveis com uma alta <a href='/academia/glossario/escalabilidade' >escalabilidade</a>, mantendo a interoperabilidade e <a href='/academia/glossario/descentralizado' >descentralização</a> na rede.</p><p class='article-header'> <strong>Customização</strong></p><p class='article-text'>Por não possuir regras definidas em suas Parachains, a Polkadot possibilita aos desenvolvedores criarem aplicações únicas, com funcionalidades otimizadas com base nos requisitos de cada projeto, afinal cada projeto é único e possui regras e objetivos diferentes. Com o <a href='/academia/glossario/protocolo' >protocolo</a> Substrate, desenvolvedores podem adaptar suas Parachains a fim de se encaixar com as necessidades do projeto.</p><p class='article-header'> <strong>Escalabilidade</strong></p><p class='article-text'>Escalabilidade também é um fator positivo na Polkadot, ao permitir que transações sejam processadas paralelamente entre diferentes Parachains. Processamento paralelo tira o peso da blockchain principal, assim possibilitando mais transações sem sobrecarregar a rede. <a href='/academia/glossario/escalabilidade' >Escalabilidade</a> é um dos principais problemas que as Blockchains enfrentam ao serem utilizadas em grande escala, e o processamento paralelo pode ser um avanço para sua adoção global.</p><p class='article-header'> <strong>Interoperabilidade</strong></p><p class='article-text'>Possibilitar que projetos e aplicações troquem informações de forma segura e anônima, é um grande fator para a Interoperabilidade da Polkadot. Existem diversas possibilidades de projetos que podem ser criados na Polkadot, e com a funcionalidade de comunicarem entre si, um ecossistema completo pode ser desenvolvido com cada parachain realizando uma função específica.</p><p class='article-header'> <strong>Descentralização</strong></p><p class='article-text'>Com cada Parachain tendo seu projeto e comunidade,  a rede se torna fortemente diversificada, e projetos <a href='/academia/glossario/descentralizado' >descentralizados</a> poderão disponibilizar aos seus usuários a possibilidades de governança. No futuro, com todas as comunidades conectadas, a governança da Polkadot será composta não apenas por um projeto em si mas por diversas comunidades que utilizam o ecossistema por completo.</p><br><p class='article-text'>Outro ponto forte da Polkadot é a capacidade de aplicar melhorias, que, por cada Parachain ser atualizada individualmente, atualizações podem facilmente serem aplicadas. Com isso, <a href='/academia/glossario/hard-fork' >Hard Forks</a> não serão necessários, evitando que comunidades sejam separadas.</p>",
        
        "<h2 class='article-header'>O que é o Token DOT?</h2><p class='article-text'><span class='detailSpan'>>> </span><strong>DOT é o token nativo da Polkadot, assim como a Ethereum tem o ETH, Bitcoin tem BTC, Avalanche tem AVAX e etc...</strong><span class='detailSpan'>&lt&lt</span></p><br><p class='article-text'>Existem vários usos para esse token dentro da plataforma da Polkadot. Um dos principais usos é em relação à governança. Usuários que possuem DOT recebem poder de voto em decisões majoritárias da rede, como atualizações, definições de taxas, e lançamento ou remoção de Parachains de seu ecossistema.</p><p class='article-header'>Staking na Polkadot</p><p class='article-text'>Assim como outras redes que utilizam protocolos <a href='/academia/glossario/proof-of-stake-pos' >Proof of Stake (PoS)</a>, o mecanismo de <a href='/academia/glossario/consenso' >consenso</a> da Polkadot é feito através de validadores, que recebem esse cargo ao realizar o Staking de seus tokens DOT na rede. Usuários podem utilizar seus DOT para receber recompensa com o processo de <a href='/academia/glossario/staking' >Staking</a>.</p><br><p class='article-text'><a href='/academia/glossario/validador' >Validadores</a> são incentivados a validar de forma honesta, para em troca receber recompensas. Enquanto validadores honestos se beneficiam do protocolo Proof of Stake(PoS), validadores com más-intenções correm o risco perder seu Stake caso tente quebrar as regras.</p><p class='article-header'>Polkadot Bond</p><p class='article-text'>Uma terceira forma de usar DOT é através do sistema de “Bond”, um mecanismo para definir qual Parachains são adicionadas à plataforma. Durante o período de Bonding seus <a href='/academia/glossario/tokens' >tokens</a> ficam travados na plataforma e são devolvidos quando o Bonding terminar ou caso a Parachain seja removida.</p>",
        
        "<h2 class='article-header'>Considerações Finais</h2><p class='article-text'>Polkadot é um ambiente onde desenvolvedores podem lançar aplicações únicas, facilmente customizáveis e com o poder de comunicar com outras aplicações do ecossistema da Polkadot. Por possuir essa característica única de desenvolvimento customizável, é muito atrativa tanto para desenvolvedores individuais quanto para grandes empresas.</p><br><p class='article-text'>Com o crescimento de suas Parachains, Polkadot busca criar um ecossistema <a href='/academia/glossario/descentralizado' >descentralizado</a> na qual, usuários terão acesso a diversas aplicações cada uma com suas próprias funcionalidades. Por ser uma rede ainda jovem, projetos grandes estão começando a surgir e com o amadurecimento da rede, <a href='/academia/glossario/protocolo' >protocolos</a> mais poderosos passarão a agregar em seu ecossistema.</p>"],
        "categories": ["blockchain"],
        "image": "DOTLogo.png",
        "date": "26/05/2022",
        "readTime": 6,
        "mainColor": "#db2777",
        "secondaryColor": "#fce7f3"
    },
    {
        "id": 7,
        "title": "Polygon (MATIC)",
        "url": "o-que-e-polygon-matic",
        "contentTitle": "O que é Polygon (MATIC)?",
        "content": ["<h2 class='article-header'>Introdução</h2><p class='article-text'>É muito mais viável acreditar que o futuro será composto por diversas <a href='/academia/glossario/blockchain' >blockchains</a> ao invés daquela concepção de que uma blockchain específica terá total controle e dominância. Com a criação de novas redes, haverá uma imensidão de redes interconectadas cada uma com suas características próprias. Polygon procura abraçar o futuro, e trazer essas mudanças hoje mesmo, criando suas soluções escaláveis e compatíveis com <a href='./ethereum-discover.html' >Ethereum</a>.</p> <br><p class='article-text'>Você já deve ter ouvido falar sobre a <a href='./cosmos-discover.html' >Cosmos</a> e como ela busca ser a “Internet das blockchains” e conectar diversas blockchains entre si, a visão da Polygon é similar, porém dentro do ecossistema da Ethereum. A idéia é oferecer aos desenvolvedores a possibilidade de lançar seus projetos compatíveis com a <a href='./ethereum-discover.html' >Ethereum</a> ou até mesmo blockchains próprias.</p> <br><p class='article-text'>Inicialmente o projeto era uma <a href='/academia/glossario/solucoes-de-segunda-camada' >solução de segunda camada</a>, chamado Matic Network, mas com a expansão de seus objetivos passou a ser uma solução para a rede das redes.</p>",
        
        "<h2 class='article-header'>O que é Polygon (MATIC)</h2><p class='article-text'>Polygon é um framework para a criação de redes <a href='/academia/glossario/blockchain' >blockchain</a> e soluções escaláveis que sejam compatíveis com a Ethereum, sendo assim, Polygon é mais do que uma simples solução mas sim um <a href='/academia/glossario/protocolo' >protocolo</a>. Seu ecossistema oferece a possibilidade de desenvolvedores criar essas redes compatíveis com a Ethereum, utilizando o Polygon SDK.</p> <br><p class='article-text'>Um dos produtos iniciais do ecossistema da Polygon foi a Polygon Network, uma rede <a href='/academia/glossario/side-chain' >sidechain</a> que utiliza de <a href='/academia/glossario/proof-of-stake-pos' >Proof of Stake (POS)</a> para validar suas transações. Uma sidechain, é um cadeia paralela conectada a outra blockchain.</p> <br><p class='article-text'><a href='/academia/glossario/side-chain' >Sidechains</a> apresentam diversos benefícios com relação à velocidade da rede e taxas reduzidas. Caso tenha utilizado da rede Polygon saberá quem suas transações são incrivelmente rápidas e com custos baixíssimos quando comparado a rede da <a href='./ethereum-discover.html' >Ethereum</a>. Contudo, há um custo para esse desempenho. Falaremos disso mais tarde.</p> <br><p class='article-text'>Como a Polygon suporta a <a href='/academia/glossario/ethereum-virtual-machine-evm' >Ethereum Virtual Machine (EVM)</a>, migrar aplicações já existentes da rede Ethereum para ela se torna relativamente fácil. Isso oferece aos usuários uma experiência similar a Ethereum, porém com a alta velocidade e taxas reduzidas que falamos anteriormente.<br></p><br><p class='article-text'><span class='detailSpan'>>></span> <strong>Seu time de desenvolvimento é liderado pelos seus fundadores: Jaynti Kanani, Sandeep Nailwal, Anurag Arjun, e Mihailo Bjelic.</strong>  <span class='detailSpan'> &lt&lt </span> <br><br></p>",
        
        "<h2 class='article-header'>Mas afinal, o que posso fazer como um usuário da rede Polygon?</h2><p class='article-text'>Sua usabilidade é similar a da <a href='./ethereum-discover.html' >Ethereum</a>, mas com um custo reduzido e alta velocidade. Algumas das plataformas <a href='/academia/glossario/decentralized-finance-defi' >DeFi</a> e <a href='/academia/glossario/aplicacao-descentralizada-dapp' >Dapps</a> mais populares já foram lançados na Polygon e podem ser utilizado com as vantagens mencionadas, como a <a href='../../cryptocurrencies/aave/aave.html' >Aave</a>, 1inch, Sushi e <a href='../../cryptocurrencies/curve-dao-token/curve-dao-token.html' >Curve</a>. Além disso, há também aplicações como a Slingshot e QuickSwap que são nativas da rede Polygon, não existindo em outros lugares.</p>",
        
        "<h2 class='article-header'>Como a Polygon funciona?</h2><p class='article-text'>A Polygon suporta 2 tipos principais de redes compatíveis com a Ethereum: Stand-alone Chains e Secured Chains. Um exemplo para uma Stand-alone chain são as <a href='/academia/glossario/side-chain' >Sidechains</a>, já um exemplo para Secured Chain são os Rollup.</p> <br><p class='article-text'>Uma Secured Chain baseia-se na infraestrutura da rede que está ligada, então não precisam adotar um sistema próprio de segurança. Ao contrário das Stand-alone Chains que precisam necessariamente cuidar de sua própria segurança. Secured Chains geralmente oferecem uma segurança elevada, enquanto Stand-alone chains são mais flexíveis.</p> <br><p class='article-text'>Em relação à rede da Polygon, sua sidechain é protegida pelos seus próprios <a href='/academia/glossario/validador' >validadores</a> e deve reportar à Ethereum periodicamente. Sua segurança é de responsabilidade própria ao invés de adotar o modelo de segurança da <a href='./ethereum-discover.html' >Ethereum</a>. Tal diferença pode ser crucial para o projeto, falaremos mais sobre isso quando explicarmos sobre Rollups.</p><br><p class='article-text'>Com a sua expansão, a plataforma da Polygon busca suportar uma maior variedade de soluções escaláveis, como <a href='/academia/glossario/zero-knowledge-proofs' >zero-knowledge (zk)</a> rollups, optimistic rollups, e Validum chains. No futuro, com cada vez mais soluções sendo implementadas, será disponível aos desenvolvedores o necessário para criarem produtos inovadores, que, por serem compatíveis com a Ethereum poderão compartilhar de suas mesmas ferramentas e carteiras, como a MetaMask.</p>",
        
        "<h2 class='article-header'>MATIC token</h2><p class='article-text'><a href='../../cryptocurrencies/polygon/polygon.html' >MATIC</a> é a principal moeda da Polygon, é usada para pagar as taxas da rede e também como a token de governança. Diversas plataformas oferecem a possibilidade de fazer <a href='/academia/glossario/staking' ></a> Stake de seus MATIC Tokens e assim gerar uma renda passiva, como <a href='/academia/glossario/exchange' >exchanges</a>, <a href='/academia/glossario/decentralized-exchange-dex' >DEX</a> ou pela Matic Web Wallet, uma plataforma criada propriamente pelo time da Polygon.</p>",
        
        "<h2 class='article-header'>Polygon Bridge</h2><p class='article-text'>A Polygon Bridge é uma plataforma oferecida pela empresa para trazer seus fundos de outras <a href='/academia/glossario/blockchain' >blockchains</a> para a sidechain da Polygon, vale ressaltar que ainda será necessário pagar as taxas convenientes da rede principal, já que a transação ocorre na <a href='/academia/glossario/mainnet' >mainnet</a>.</p> <br><p class='article-text'>Porém após finalizada a transação, pode aproveitar os benefícios da Polygon, como sua alta velocidade e taxas baixíssimas. Algumas Exchanges Centralizadas (CEX) disponibilizam a capacidade de sacar diretamente para a rede da Polygon.</p>",
        
        "<h2 class='article-header'>Sidechain X Rollups</h2><p class='article-text'>É inegável que ambos tipos de redes possuem suas diferenças e não há um consenso se sidechains podem ser consideradas <a href='/academia/glossario/solucoes-de-segunda-camada' >soluções de segunda camada</a> assim como as Rollups. É importante saber distingui-las e entender suas diferenças caso deseje compreender mais sobre multi-chains.</p> <br><p class='article-text'>Cada uma possui diferenças relacionadas a usabilidade, segurança, desenvolvimento, e desempenho. Dentro das Secured chains, Rollups são consideradas as mais promissoras visto que grande parte de sua segurança adota e baseia-se nos métodos já aplicados da <a href='./ethereum-discover.html' >Ethereum</a>.</p> <br><p class='article-text'>Contudo isso não se aplica às diversas soluções que utilizam de <a href='/academia/glossario/side-chain' >sidechains</a> como a Polygon. Não que não seja segura, mas caso usuários mal intencionados encontrem brechas na segurança, eles podem tomar controle da rede. Usar de sidechains demanda uma confiança a mais, e mesmo que não há indícios de que a segurança foi corrompida (ou que isso seja algo fácil de acontecer) é importante considerar.</p> <br><p class='article-text'>Vale também comparar com a própria Mainnet da Ethereum, que apesar de possuir taxas e tempo de transações elevadas, conta com garantias de seguranças e demanda de menos confiança de terceiros.</p> <br><p class='article-text'>Com Rollups você paga menos em taxas, possui transações rápidas e com a mesma segurança de mainnets. Porém com sidechains o valor a ser pago chega a ser frações do que pagaria, mesmo em rollups. Porém você compromete a sua segurança.</p>",
        
        "<h2 class='article-header'>Mas então qual é melhor?</h2><p class='article-text'><span class='detailSpan'>>></span> <strong>A resposta não é absoluta e depende de suas necessidades específicas.</strong>  <span class='detailSpan'> &lt&lt </span> <br><br></p><p class='article-text'>Pense em uma rede social atrelada à <a href='/academia/glossario/blockchain' >blockchain</a>, onde é necessária uma quantidade imensa de <a href='/academia/glossario/transacoes-por-segundo-tps' >transações por segundo</a> com taxas baixíssimas (nenhum usuário quer pagar U$10,00 e levar 30 minutos para postar uma foto) para esse caso seria viável sacrificar parte de sua garantia de segurança para uma usabilidade melhor.</p> <br><p class='article-text'>Em contraste, para guardar a reserva nacional de um país, é extremamente necessário garantias de segurança, e vale pagar mais por isso, visto que também não se é necessário realizar transações com alta velocidade.</p>",
        
        "<h2 class='article-header'>Conclusão</h2><p class='article-text'>Polygon é uma estrutura para criar soluções escaláveis que são compatíveis com a rede <a href='./ethereum-discover.html' >Ethereum</a>. A rede  Polygon é uma <a href='/academia/glossario/side-chain' >sidechain</a> que utiliza de <a href='/academia/glossario/proof-of-stake-pos' >Proof of Stake (PoS)</a> e que ganhou forte adoção devido a sua alta velocidade para realizar transações, taxas ínfimas e compatibilidade com a <a href='/academia/glossario/ethereum-virtual-machine-evm' >EVM</a>.</p> <br><p class='article-text'>No futuro poderemos ver a Polygon oferecendo mais soluções de escalabilidade, incluindo diferentes tipos de Rollups e Stand-alone blockchains, na qual auxiliaram desenvolvedores a criarem produtos inovadores que agregarão para um melhor ecossistema de <a href='/academia/glossario/solucoes-de-segunda-camada' >segunda camada</a> para a Ethereum.</p>"],
        "categories": ["blockchain"],
        "image": "MATICLogo.png",
        "date": "23/05/2022",
        "readTime": 8,
        "mainColor": "#7c3aed",
        "secondaryColor": "#ede9fe"
        
    },
    {
        "id": 8,
        "title": "Solana (SOL)",
        "url": "o-que-e-solana-sol",
        "contentTitle": "O que é Solana (SOL)?",
        "content": ["<p class='article-text'><strong>Solana é uma blockchain focada na experiência do usuário, possibilitando grandes quantidades de transações de forma rápida e barata.</strong></p><br><p class='article-text'><strong>Utilizando SOL, seu token nativo, usuários podem interagir entre si e com os contratos inteligentes.</strong></p>",
        
        "<h2 class='article-header'>Introdução</h2><p class='article-text'>Quando o assunto é Blockchain, um desafio comum entre todas as redes é a <a href='/academia/glossario/escalabilidade' >escalabilidade</a>, e com o crescimento de usuários das redes blockchain, esse desafio tem um prazo cada vez menor para ser solucionado. Redes com pouca escalabilidade encontram altas taxas de transação e demoram mais tempo para ter suas transações confirmadas, o que acaba afastando alguns usuários.</p><br><p class='article-text'>Fundada pela empresa Solana Labs em 2017, a Solana busca resolver esse desafio sem comprometer sua segurança e a descentralização. Diferente de outras Blokchains como <a href='./ethereum-discover.html' >Ethereum</a> e <a href='./bitcoin-discover.html' >Bitcoin</a>, a Solana utilizada um método chamado Proof of History (PoH), na qual possibilita que a rede faça milhares de <a href='/academia/glossario/transacoes-por-segundo-tps' >transações por segundo</a>.</p>",

        "<h2 class='article-header'>O que é a Solana?</h2><p class='article-text'>Solana é uma <a href='/academia/glossario/blockchain' >Blockchain</a> de terceira geração que utiliza o protocolo <a href='/academia/glossario/proof-of-stake-pos' >Proof-of-Stake(PoS)</a> para validação. Porém, tem como diferencial um sistema que determina o tempo de cada transação, o chamado Proof-of-History (PoH).</p><br><p class='article-text'>É fundamental para uma <a href='/academia/glossario/criptomoedas' >criptomoeda</a> que a sua Blockchain mantenha as transações em ordem. Usando o <a href='./bitcoin-discover.html' >Bitcoin</a> como exemplo, ele faz isso ao agrupar transações em um <a href='/academia/glossario/bloco' >bloco</a> com um único registro de data e hora. Esses blocos são então validados pelos nodes, que ao entrarem em um consenso adicionam o bloco a Blockchain.</p><br><p class='article-text'>Esse processo é eficaz e seguro, porém adiciona um grande tempo para confirmar que um bloco é válido a entrar na Blockchain.</p>",
        
        "<h2 class='article-header'>O que é Proof of History?</h2><p class='article-text'>Todas as transações que ocorrem na Solana são <a href='/academia/glossario/criptografia' >criptografadas</a>, e transformadas em Hash usando o <a href='/academia/glossario/protocolo' >protocolo</a> SHA-256. Esse processo, pega uma informação e gera uma resposta única que é extremamente difícil de prever chamada <i>Output</i>. Solana utiliza o <i>output</i> dessa transação como informação para o próximo <a href='/academia/glossario/hash' >hash</a>.</p><br><br><p class='article-text'><strong>SHA-256</strong></p><br><p class='article-text'><strong>Transação A <span class='detailSpan'>>></span>Transformado em Hash <span class='detailSpan'>>></span><i>Output A</i></strong></p><br><p class='article-text'><strong>Transação B <span class='detailSpan'>>></span>Processo de Hash <span class='detailSpan'>>></span><i>Output B</i></strong></p><br><p class='article-text'><strong>Transação C <span class='detailSpan'>>></span>Processo de Hash <span class='detailSpan'>>></span><i>Output C</i></strong></p><br><br><p class='article-text'><strong>Solana</strong></p><br><p class='article-text'><strong><i>Output A</i> <span class='detailSpan'>=-=-=</span> <i>Output B</i><span class='detailSpan'>=-=-=</span><i>Output C</i>...</strong></p><br><br><p class='article-text'>Com esse processo, uma cadeia de transações em formato de <a href='/academia/glossario/hash' >Hash</a> é criada e conectada pelos outputs de cada transação. Isso faz com que a ordem das transações seja visível, facilitando o trabalho dos <a href='/academia/glossario/validador' >validadores</a> para adicionar essas transações em um <a href='/academia/glossario/bloco' >bloco</a>, e descartando o uso de registros de data e hora convencionais.</p><br><p class='article-text'>Proof of History realiza um processo diferente do mecanismo de consenso do Bitcoin, o <a href='/academia/glossario/proof-of-work-pow' >Proof of Work (PoW)</a>.</p><br><p class='article-text'>No Bitcoin blocos são formados por um grande número de transações desordenadas, e cada <a href='/academia/glossario/bloco' >bloco</a> tem seu registro de data e hora definido pelo <a href='/academia/glossario/mineradores' >minerador</a> que minerou o bloco conforme o horário local do minerador. O tempo entre diferentes <a href='/academia/glossario/node' >nodes</a> pode variar ou até mesmo ser falso, o que demanda um tempo para o node fazer essa validação.</p><br><p class='article-text'>Como o Proof of History ordena as transações em uma cadeia de Hashes, validadores não precisam definir o horário através de registro de data e hora, e por se tratar de Hash, processam menos informações em cada bloco. Dessa forma, o tempo de confirmação de novos blocos é reduzido drasticamente.</p>",
        
        "<h2 class='article-header'>Afinal, o Proof of History é um Mecanismo de Consenso?</h2><p class='article-text'>É importante entender que o Proof of History é um processo para definir uma ordem nas transações e acelerar a confirmação de novos blocos, e não se qualifica como um mecanismo de consenso como o <a href='/academia/glossario/proof-of-stake-pos' >Proof-of-Stake</a>. Na verdade, ambos trabalham em conjunto para que definir um próximo validador de um bloco seja muito mais fácil.</p><br><p class='article-text'>Como os nodes processam menos informações e precisam de menos tempo para validar a ordem das transações, o tempo para definir o próximo validador de um novo bloco também é muito mais rápido.</p>",
        
        "<h2 class='article-header'>Os 8 Núcleos da Solana</h2><p class='article-text'>Para poder trabalhar com velocidade e eficiência que seja comparável a um sistema <a href='/academia/glossario/centralizado' >centralizado</a>, a equipe da Solana desenvolveu oito núcleos que maximizam o poder da rede, sendo o principal deles o Proof of History.</p><br><p class='article-text'><strong> Além do Proof of History, existem outros 7 núcleos são eles:</strong></p><br><br><p class='article-text'><strong>Turbine -</strong> Protocolo de propagação de blocos.</p><br><p class='article-text'><strong>Gulf Stream -</strong> Protocolo <a href='/academia/glossario/memory-pool-mempool' >Mempool</a> de gerenciamento transações.</p><br><p class='article-text'><strong>Sealevel –</strong> Sistema que pré-executa Smart Contracts Paralelamente.</p><br><p class='article-text'><strong>Pipelining –</strong> Uma unidade de processamento de transações para otimizar as validações.</p><br><p class='article-text'><strong>Cloubreak –</strong> Base de dados de usuários em escalabilidade horizontal.</p><br><p class='article-text'><strong>Archivers –</strong> Armazém de dados distribuídos.</p><br><br><p class='article-text'>Esses núcleos fazem com que a rede da Solana tenha uma alta performance e possa realizar milhares de <a href='/academia/glossario/transacoes-por-segundo-tps' >transações por segundo</a>, com um tempo de criação de bloco de 4 segundos. Para se ter uma noção, o tempo de criação de um bloco na Rede <a href='./ethereum-discover.html' >Ethereum</a> é aproximadamente 15 segundos, já na rede do <a href='/academia/glossario/bitcoin' >Bitcoin</a> são 10 minutos.</p>",
        
        "<h2 class='article-header'>O que é SOL?</h2><p class='article-text'><strong><span class='detailSpan'>>></span>Assim como a Ethereum tem o ETH e o Bitcoin tem o BTC, a Solana tem o SOL<span class='detailSpan'>&lt&lt</span></strong></p><br><br><p class='article-text'>SOL é a criptomoeda nativa da Solana, e serve tanto como <a href='/academia/glossario/token-de-utilidade' >token de utilidade</a> quanto de governança da rede.  Usuários precisam pagar taxas para realizar transações, e interagir com <a href='/academia/glossario/smart-contracts' >Smart Contracts</a>, e essas taxas são pagas com SOL. Assim como na Ethereum, a Solana permite que usuários criem projetos e Smart Contracts que se baseiam no sistema <a href='/academia/glossario/blockchain' >Blockchain</a>.</p><br><p class='article-text'>A rede possui um modelo deflacionário, que queima parte do SOL coletado em cada transação.</p>",
        
        "<h2 class='article-header'>Staking de SOL</h2><p class='article-text'>Holders de SOL podem realizar o <a href='/academia/glossario/staking' >Staking</a> de seus tokens para se tornarem <a href='/academia/glossario/validador' >validadores</a> da rede. Por utilizar do protocolo Proof-of-Stake, a Solana precisa de validadores para que as transações da rede sejam efetuadas e validadas de forma segura, e em troca desses serviços, validadores são recompensados. na data em que escrevemos esse artigo a recompensa para os validadores da solana é <a href='/academia/glossario/annual-percentage-yield-apy' >APY</a> aproximado de 5%.</p><br><p class='article-text'>Assim como em outras redes <a href='/academia/glossario/proof-of-stake-pos' >Proof-of-Stake</a>, validadores são incentivados a trabalharem honestamente para assim se tornarem aptos a receber as recompensas. Ao contrário, correm o risco de perder seus tokens em Stake.</p><br><p class='article-text'>É possível também delegar seus tokens para os validadores, assim, Holders de SOL que não desejam se tornar validadores podem disponibilizar seus tokens a usuários que já são validadores, para em troca receber uma recompensa definida entre ambas as partes.</p><br>",
        
        "<h2 class='article-header'>Como SOL é utilizado?</h2><p class='article-text'>Tokens SOL utilizam o protocolo SPL, protocolo padrão de tokens fungíveis da Solana, (similar ao <a href='/academia/glossario/erc-20' >ERC-20</a> da Ethereum) e possui 2 usos principais:</p><br><p class='article-text'><strong>- Pagar as <a href='/academia/glossario/taxa-de-transacao' >taxas de transação</a> ao utilizar a rede ou interagir com Smart Contracts.</strong> </p><br><p class='article-text'><strong>- Realizar o Staking de seus tokens como parte do sistema Proof-of-Stake.</strong> </p><br><br><p class='article-text'>Com o aumento da atividade na rede, seu ecossistema vai se formando, e junto com novos projetos novas usabilidades para o token SOL serão desenvolvidas.</p>",
        
        "<h2 class='article-header'>Como guardar SOL?</h2><p class='article-text'>Para guardar Solana deve-se utilizar uma <a href='/academia/glossario/wallet' >carteira</a> que tenha suporte a tokens SPL, Alguns exemplos são a Phantom, Trust Wallet, SolFlare e Sollet. Algumas dessas carteiras possibilitam também realizar ou delegar o Staking de seus <a href='/academia/glossario/tokens' >tokens</a>, como por exemplo, a SolFlare.</p>",
        
        "<h2 class='article-header'>Considerações Finais</h2><p class='article-text'>Mesmo sendo um projeto relativamente novo, Solana cumpriu bem suas promessas e trouxe uma velocidade e escalabilidade pouco vista em redes Blockchains. Esse sucesso da rede refletiu também no preço de seu token SOL, que teve uma explosão desde seu <a href='/academia/glossario/initial-coin-offering-ico' >ICO</a>, saindo de U$0,22 para aproximadamente U$250,00 em sua <a href='/academia/glossario/alta-historica-ath' >alta-histórica</a>.</p><br><p class='article-text'>Por mais que a Solana tenha um potencial absurdo, esse potencial ainda não foi testado. Precisaremos que mais usuários utilizem a rede para perceber os benefícios de uma rede rápida e com alta <a href='/academia/glossario/escalabilidade'>escalabilidade</a> e assim avaliar as diferenças com relação às outras Blockchains.</p>"],
        "categories": ["blockchain"],
        "image": "SOLLogo.png",
        "date": "07/06/2022",
        "readTime": 7,
        "mainColor": "#7c3aed",
        "secondaryColor": "#ede9fe"
    }
]