[
    {
        "id": 1,
        "title": "Avalanche",
        "ContentTitle": "O que é Avalanche (AVAX)?",
        "content": ["<h2 class='article-header'>Introdução</h2><p class='article-text'>Avalanche busca melhorar a escalabilidade mantendo sua velocidade e descentralização. É formada por 3 <a href='../glossary/blockchain-glossary.html'>blockchains</a>:Exchange Chain (X-Chain), Contract Chain (C-Chain) e Platform Chain (P-Chain)cada uma tendo sua própria usabilidade tornando a rede efetivamente mais rápida, falaremos mais sobre isso ao longo do artigo.<br><br></p><p class='article-text'>Outro ponto chave é seu <a href='../glossary/protocolo-glossary.html'>protocolo</a> Avalanche Consensus, um método de validação que busca ser rápido e viável aumentando assim a <a href='../glossary/descentralizado-glossary.html'>descentralização</a> da rede, e com as suas Subnets escalando de forma horizontal permite a criação de diversas blockchain interoperáveis. Por não possuir limite de Subnets, torna-se uma rede com potencial próximo ao infinito. <br><br></p><p class='article-text'>Avalanche afirma possuir a rede mais rápida do mercado de <a href='../glossary/blockchain-glossary.html'>blockchains</a>e buscar unir escalabilidade e descentralização com baixas taxas de rede.</p>", 
        
        "<h2 class='article-header'>Lançamento</h2><p class='article-text'>Avalanche foi lançada em setembro de 2020 pela Ava Labs, um time de NY, EUA.Em seu lançamento Ava Labs arrecadou aproximadamente U$300 milhões em fundos,e com as a vendas públicas e privadas de seus <a href='../glossary/tokens-glossary.html'>tokens</a> (AVAX) a Avalanche Foundation adquiriuU$48 milhões. O time de fundadores por trás da Ava Labs consiste em três pessoas, Kevin Sekniqi, Maofan 'Ted' Yin e Emin Gün Sirer</p>", 
        
        "<h2 class='article-header'>Quais problemas a Avalanche soluciona?</h2><p class='article-text'>Avalanche busca solucionar 3 problemas principais:</p><ul><li><strong> - Escalabilidade</strong></li><li><strong> - Taxas de transações</strong></li><li><strong> - Interoperabilidade</strong></li></ul>", 
        
        "<h2 class='article-header'>Escalabilidade e Descentralização</h2><p class='article-text'><a href='../glossary/blockchain-glossary.html'>Blockchains</a> tradicionalmente enfrentam problemas em balancear escalabilidade e descentralização. Uma rede com sua atividade crescente pode congestionar rapidamente trazendo atrasos em suas transações. <a href='./bitcoin-discover.html'>Bitcoin (BTC)</a> é um bom exemplo,já que as transações podem levar horas ou até dias para serem processadas em períodos de congestionamento na rede. </p><br><p class='article-text'>Uma forma de combater isso é transformar a rede mais <a href='../glossary/centralizado-glossary.html'>centralizada</a>, oferecendo a poucas pessoas a autoridade de validar as atividades da rede, gerando uma maior velocidade. Contudo, decentralização é fundamental para a segurança de uma <a href='../glossary/blockchain-glossary.html'>blockchain</a>. Novas tecnologias vêm surgindo para solucionar esse problema, e a Avalanche desenvolveu a sua própria, falaremos disso mais tarde.</p>", "<h2 class='article-header'>Taxas Elevadas</h2><p class='article-text'>Outro problema comum em grandes Blockchains como a <a href='./ethereum-discover.html'>Ethereum</a> são as taxas de <a href='../glossary/gas-glossary.html'>gas</a>, que podem ficar elevadas com o congestionamento. Isso definitivamente desencoraja os usuários dessas Blockchains, mas as Blockchains alternativas possuem ecossistemas menos estabelecidos. A popularidade da Ethereum e suas poucas alternativas, o levaram a ter tráfego e taxas elevadas. Em momentos de congestionamento é possível ver transferências simples custando mais de U$10 e interações mais complexas passando a casa dos U$100.</p>", 

        "<h2 class='article-header'>Interoperabilidade</h2><p class='article-text'>Diferentes projetos e negócios possuem suas próprias necessidades com relação a <a href='../glossary/blockchain-glossary.html'>Blockchain</a>. Antigamente projetos deveriam trabalhar juntamente ou com a <a href='./ethereum-discover.html'>Ethereum</a>, outra blockchain individual não relacionada ás suas necessidades, ou com blockchains privadas. Mas encontrar equilíbrio entre customização e cooperação entre múltiplas blockchains é de fato desafiador. Avalanche busca solucionar esse problema com Subnets -  Blockchain customizadas especificas de cada aplicação que compartilham da segurança, velocidade e compatibilidade da sua rede primária.</p>", 
        
        "<h2 class='article-header'>Como a Avalanche funciona?</h2><p class='article-text'>Avalanche utiliza uma combinação de métodos que a torna única e é formada atualmente por três blockchains primárias interoperáveis, a  X-Chain, C-Chain, e P-Chain. </p><br><p class='article-text'><b>1.  X-Chain (The Exchange Chain) </b> é usada para criar e trocar os token <a href='../../cryptocurrencies/avalanche/avalanche.html'>AVAX</a> e outros ativos digitais. As taxas de transações são pagas em AVAX e a Blockchain usa o protocolo Avalanche Consensus.</p><br><p class='article-text'><b> 2.  C-Chain (The Contract Chain) </b> é onde os desenvolvedores criam <a href='../glossary/smart-contracts-glossary.html'>contratos inteligentes</a> e DApps. Essa rede implementa uma instancia da <a href='../glossary/ethereum-virtual-machine-evm-glossary.html'>Ethereum Virtual Machine (EVM)</a> habilitando <a href='../glossary/aplicacao-descentralizada-dapp-glossary.html'>DApps</a> compatíveis com a EVM. Utiliza de uma versão modificada do <a href='../glossary/protocolo-glossary.html'>protocolo</a> Avalanche Consensus chamada de Snowman.</p><br><p class='article-text'><b> 3.  P-Chain (The Platform Chain)</b> Coordena <a href='../glossary/validador-glossary.html'>validadores</a> da rede, analisa as Subnets ativas e permite a criação de novas Subnets. A P-Chain também usa o Protocolo Snowman.</p><br><p class='article-text'> Com cada <a href='../glossary/blockchain-glossary.html'>Blockchain</a> tendo uma função diferente, Avalanche melhora a velocidade e escalabilidade comparado a rodar todos os processos em uma única Blockchain.  Os desenvolvedores da Avalanche adaptaram mecanismos de <a href='../glossary/consenso-glossary.html'>consenso</a> para a necessidade de cada Blockchain, e os usuários precisam de AVAX para fazer o <a href='../glossary/staking-glossary.html'>stake</a> e pagar as taxas da rede, oferecendo ao ecossistema uma moeda de uso comum.</p>", 
        
        "<h2 class='article-header'>Como funcionam os mecanismos de consenso da Avalanche?</h2><p class='article-text'>Ambos <a href='../glossary/protocolo-glossary.html'>protocolos</a> de consenso da Avalanche possuem similaridades. Esse sistema duplo é o motivo principal para a alta velocidade e escalabilidade da rede.</p><h2 class='article-header'>Avalanche Consensus</h2><p class='article-text'>O protocolo Avalanche Consensus não precisa de um “líder” para chegar ao consenso como na <a href='../glossary/proof-of-work-pow-glossary.html'>Proof of Work (PoW)</a>, <a href='../glossary/proof-of-stake-pos-glossary.html'>Proof of Stake (PoS)</a> ou <a href='../glossary/delegated-proof-of-stake-dpos-glossary.html'>Delegated Proof of Stake (DPoS)</a>. Esse fator aumenta a descentralização na rede da Avalanche sem sacrificar sua escalabilidade. Em contrapartida PoW, PoS e DPoS acabam tendo um “líder” que atua processando as transações, cujo trabalho é então validado pelos outros.</p> <br><p class='article-text'>Avalanche implementa um <a href='../glossary/directed-acyclic-graph-dag-glossary.html'>Directed Acyclic Graph (DAG)</a> juntamente com seu protocolo de consenso otimizado. Um DAG permite que a rede processe transações paralelas. Os <a href='../glossary/validador-glossary.html'>validadores</a> analisam uma amostra de outros validadores para determinar se um nova transação é valida, e após um certo número de repetições desse processo aleatório de amostras validadas, a estatística mostra que seria impossível tal transação ser falsa.</p><br><p class='article-text'>Todas as transações são finalizadas imediatamente sem confirmações adicionais serem necessárias. Rodar um <a href='../glossary/node-glossary.html'>node</a> de validação e validar transações na Avalanche requerem pouco uso de hardware sendo assim acessível, melhorando sua desempenho e descentralização.</p>", 
        
        "<h2 class='article-header'>Snowman</h2><p class='article-text'>O Segundo <a href='../glossary/protocolo-glossary.html'>protocolo</a> presente na rede da Avalanche o protocolo de consenso Snowman, também realiza a validação pelo consenso porém ordena as transações linearmente. Ou seja, diferente do protocolo Avalanche Consensus (que utiliza DAG), Snowman cria blocos. </p> <br><h2 class='article-header'>AVAX Token</h2><p class='article-text'>AVAX é o token nativo da rede avalanche com um <a href='../glossary/max-supply-glossary.html'>Max Supply</a> de 720 milhões. As transferências na rede são pagas utilizando AVAX e todas as <a href='../glossary/taxa-de-transacao-glossary.html'>taxas de transação</a> são queimadas como um mecanismo deflacionário. </p> <br><p class='article-text'><span class='detailSpan'>>></span> <b>AVAX Possui três usos principais:</b>  <span class='detailSpan'> &lt&lt </span> <br><br></p><p class='article-text'><b>1.  Staking -</b> é possível realizar o <a href='../glossary/staking-glossary.html'>Stake</a> de AVAX para tornar-se um <a href='../glossary/validador-glossary.html'>validador</a> ou delegá-lo a um validador. Validadores recebem um adicional referente ao seu valor em stake com um Annual Percentage Yield (APY) próximo a 10%, e define um percentual disso para os delegadores que  o apoiaram.</p><br><p class='article-text'><b>2.  Interoperabilidade -</b> AVAX é utilizado como uma unidade comum para todas as Subnets da rede, melhorando assim a interoperabilidade entre elas.</p><br><p class='article-text'><b>3.  Taxas -</b> AVAX é a moeda principal da rede sendo utilizada para pagar as taxas de transação e inscrições nas Subnets.</p>", "<h2 class='article-header'>Stake de AVAX</h2><p class='article-text'>Holders de AVAX podem ganhar recompensas tornando-se um validador ou realizando o <a href='../glossary/staking-glossary.html'>staking</a> com validadores já existentes. Para tornar-se um validador é necessário ter em Stake 2.000 <a href='../../cryptocurrencies/avalanche/avalanche.html'>AVAX</a>. </p> <br><p class='article-text'>Por sua rede otimizada, o poder computacional necessário para ser um <a href='../glossary/validador-glossary.html'>validador</a> é baixo e as maiorias dos computadores são capazes de validar as transações.</p>", "<h2 class='article-header'>Como a rede da Avalanche se difere de outras redes com alta escalabilidade?</h2><p class='article-text'><b> Avalanche compete com outras redes de alta escalabilidade como a Ethereum, <a class='articleLink' href='./polygon-discover.html'>Polygon</a> e <a class='articleLink' href='./solana-discover.html'>Solana</a> mas o que a torna tão única de suas alternativas?</b></p>", "<h2 class='article-header'>Mecanismos de Consenso</h2><p class='article-text'>O principal diferencial é seu <a href='../glossary/protocolo-glossary.html'>protocolo</a> Avalanche Consensus, que permite transações em alta velocidade. Mas a Avalanche não é a única a possuir um mecanismo de validação pelo consenso. <a href='./solana-discover.html'>Solana</a> possui Proof of History que pode lidar com mais de 50.000 <a href='../glossary/transacoes-por-segundo-tps-glossary.html'>Transações por Segundo (TPS)</a>superando as 6.500 TPS que a Avalanche afirma ser capaz. Porém não se dever analisar somente A TPS para identificar a velocidade de uma rede.</p>", 
        
        "<h2 class='article-header'>Velocidade da rede e finalização</h2><p class='article-text'>Outro diferencial da Avalanche é seu tempo de finalização. Menor que 1 segundo. O que isso significa? E como isso a torna uma rede mais rápida? Após realizar uma transação é preciso garantir que foi realizada e que não pode ser revertido ou alterada, e esse processo pode ter um atraso em outras <a href='../glossary/blockchain-glossary.html'>Blockchains</a>. Pode-se ter 150.00 <a href='../glossary/transacoes-por-segundo-tps-glossary.html'>TPS</a> mas se tiver um atraso na finalização a rede ainda assim será lenta. Avalanche utiliza disso ao seu poder, e afirma ter o tempo de finalização mais rápido do mercado.</p>" , "<h2 class='article-header'>Descentralização</h2><p class='article-text'>Um dos principais focos da Avalanche é a <a href='../glossary/descentralizado-glossary.html'>descentralização</a>. E levando em consideração o tamanho, possui um grande número de <a href='../glossary/validador-glossary.html'>validadores</a> ativos, (mais de 1300 em abril de 2022) possivelmente pelo fato de necessitar de baixo poder computacional para tornar-se validador. Entretanto, com o preço da <a href='../../cryptocurrencies/avalanche/avalanche.html'>AVAX</a> elevado atuar como validador tem se tornado cada vez mais caro.</p>", "<h2 class='article-header'>Interoperabilidade</h2><p class='article-text'>A interoperabilidade da <a href='../glossary/blockchain-glossary.html'>Blockchain</a> da Avalanche é potencialmente ilimitada. Para utilizar de sua rede basta uma simples taxa de inscrição que comparada com outras redes como a <a href='./polkadot-discover.html'>Polkadot</a>, na qual oferece de leilões por vagas em sua Parachain, é muito mais versátil e de fácil acesso ao público em geral.</p>", "<h2 class='article-header'>Considerações finais</h2><p class='article-text'>Com as <a href='../glossary/decentralized-finance-defi-glossary.html'>Finanças Descentralizadas</a> em seu ápice e crescendo diariamente, têm se buscado alternativas para redes lentas e com altas taxas, redes como a Avalanche tornaram-se os principais concorrentes da <a href='./ethereum-discover.html'>Ethereum</a> devido a sua compatibilidade com a <a href='../glossary/ethereum-virtual-machine-evm-glossary.html'>EVM</a> e taxas de transação baixas. Porém o mercado possui um vasto número de Plataformas <a href='../glossary/decentralized-finance-defi-glossary.html'>DeFi</a> com alta velocidade e escalabilidade.</p><br><p class='article-text'>Avalanche tem se destacado e crescido desde seu lançamento, e já está em um nível de comparar-se a <a href='./ethereum-discover.html'>Ethereum</a> em transações diárias, agora devemos esperar para ver se poderá se comparar com outras <a href='../glossary/blockchain-glossary.html'>blockchains</a> de alta escalabilidade como a  <a class='articleLink' href='./solana-discover.html'>Solana</a>e a <a class='articleLink' href='./polygon-discover.html'>Polygon</a>.</p>"],
        "categories": ["blockchain"],
        "image": ["AVAXLogo.png"],
        "date": "22/05/2022",
        "readTime": 8,
        "mainColor": "#dc2626"
    }
]