[
    {
        "id": 1,
        "title": "Trilema das Redes Blockchains",
        "url": "o-que-e-trilema-das-redes-blockchains",
        "contentTitle": "O que é Trilema das Redes Blockchain?",
        "content": ["<h2 class='article-header'>Trilema da Redes Blockchain</h2><p class='article-text'>Para que uma rede Blockchain se mantenha com seus princípios, são necessários que 3 pontos estejam alinhados e em equilíbrio, são eles:</p><br> <ul><li><p class='article-text'><b>- Escalabilidade</b></p></li><li><p class='article-text'><b>- Segurança</b></p></li><li><p class='article-text'><b>- Descentralização</b></p></li></ul><br><br><p class='article-text'>O trilema das redes blockchain, é um conceito descrito pelo criador da Ethereum, Vitalik Buterin, na qual define que caso opte por otimizar dois desses pontos, o terceiro ficará em falta, resultando numa quebra dos princípios da Blockchain. </p>", 

        "<h2 class='article-header'>Segurança e Descentralização</h2> <p class='article-text'>Pensando no Ethereum e no Bitcoin como exemplo, que priorizam a <b>Segurança e Descentralização</b> tem seu algoritmo de <a href='/academia/glossario/consenso' target='_blank'>consenso</a> programado de forma que garante a segurança nas transações, mas ao mesmo tempo reflete em uma menor <a href='/academia/glossario/escalabilidade' target='_blank'>escalabilidade</a>. Com diversos <a href='/academia/glossario/node' target='_blank'>nodes</a> recebendo e validando transações, sua rede se torna mais lenta e com taxas superiores a alternativas centralizadas.</p><br>",
                
        "<h2 class='article-header'>Escalabilidade e Segurança</h2><p class='article-text'>Caso o limite de transações por <a href='/academia/glossario/bloco'target='_blank'>bloco</a> aumente a rede terá uma maior <a href='/academia/glossario/escalabilidade' target='_blank'>escalabilidade</a>, porém terá uma menor <a href='/academia/glossario/descentralizado' target='_blank'>descentralização</a>. Isso se dá, pois com mais transações por bloco, o bloco será maior e demandará de um maior poder computacional para que os blocos sejam validados e armazenados pelos nodes. </p><br><p class='article-text'>Com isso, nodes pequenos deixarão a rede que ao longo do tempo terá apenas uma fração de nodes com poder computacional altíssimo, tornando-se uma rede mais <a href='/academia/glossario/centralizado' target='_blank'>centralizada</a>. Você alcançará uma rede com <b>Escalabilidade e Segurança</b>, porém com uma menor descentralização. </p><br>",
                
        "<h2 class='article-header'>Escalabilidade e Descentralização</h2><p class='article-text'>Por fim, em uma rede que otimiza a <b>Escalabilidade e Descentralização</b>, terá uma rede rápida e com transações baratas, porém qualquer um poderá ser um <a href='/academia/glossario/validador' target='_blank'>validador</a>, o que pode trazer problemas ao mecanismo de consenso, tornando-a insegura.</p>"],
        "categories": ["blockchain", "ethereum"],
        "image": "PICLogo.png",
        "date": "26/05/2022",
        "readTime": 4,
        "mainColor": "#2563eb",
        "secondaryColor": "#dbeafe"
    },  
    {
        "id": 1,
        "title": "Ethereum Casper",
        "url": "o-que-e-ethereum-casper",
        "contentTitle": "O Que é Ethereum Casper?",
        "content": ["<h2 class='article-header'>Introdução ao Ethereum Casper</h2><p class='article-text'>Lançado em 2015 como uma Blockchain Proof of Work, <a href='/academia/glossario/ethereum' target='_blank'>Ethereum</a> está para receber uma de suas maiores atualizações, a Ethereum 2.0. Seu lançamento busca trazer diversas melhorias sendo uma dela a transição de <a href='/academia/glossario/proof-of-work-pow' target='_blank'>Proof of Work</a> para <a href='/academia/glossario/proof-of-stake-pos' target='_blank'>Proof of Stake</a>, com a implementação do mecanismo chamado Ethereum Casper</p><br><p class='article-text'>Desenvolvedores da Ethereum já planejam fazer uma transição de longo prazo para o modelo de validação por Staking, e o Ethereum Casper será o mecanismo que possibilitará isso. Após a transição ser concluída, não será mais possível <a href='/academia/glossario/mineracao' target='_blank'>minerar</a> na Ethereum, tornando-a 100% Proof of Stake.</p> <br>",
        
        "<h2 class='article-header'>Serenity e o modelo Proof of Stake</h2><p class='article-text'>Nesse processo de atualização da <a href='/academia/descubra/o-que-e-ethereum-eth' target='_blank'>Ethereum</a>, um cronograma de atualizações chamado Serenity foi desenvolvido para guiar a transição para Ethereum 2.0. Em sua fase inicial Serenity traz uma nova <a href='/academia/glossario/blockchain' target='_blank'>Blockchain</a> chamada Beacon Chain. Com isso, usuários poderão realizar Staking de seus tokens ETH para se tornarem <a href='/academia/glossario/validador' target='_blank'>validadores</a> da rede.</p><br><p class='article-text'>Diferente do modelo Proof of Work, na qual depende de <a href='/academia/glossario/mineradores' target='_blank'>mineradores</a> disponibilizando poder computacional para criar e validar os blocos de transação, no modelo Proof of Stake esse trabalho é feito pelos validadores, que usando seus tokens, verificam e validam as transações dos <a href='/academia/glossario/bloco-glossary' target='_blank'>blocos</a>. O Ethereum Casper trará esse novo modelo por completo e removerá o processo de mineração da Etherum.</p>",
        
        "<h2 class='article-header'>Como ser um validador na Ethereum?</h2><p class='article-text'>Caso deseje tornar-se um validador na <a href='/academia/descubra/o-que-e-ethereum-eth' target='_blank'>Ethereum</a> já é possível, a primeira fase da Serenity já foi implementada e nela trouxe a Beacon Chain, uma <a href='/academia/glossario/blockchain' target='_blank'>Blockchain</a> que possibilita uma prévia do modelo Proof of Stake. </p><br><p class='article-text'>Para isso, é necessário colocar seus tokens ETH em <a href='/academia/glossario/staking' target='_blank'>Staking</a> e o “poder de voto” depende da quantidade de tokens que o validador está alocando para validação. Em outras palavras caso um validador disponibilize 64 ETH, seu voto terá peso dobrado em relação ao de um validador que dispôs a quantidade mínima, no caso 32 ETH, para tornar-se um <a href='/academia/glossario/validador' target='_blank'>validador</a>.</p><br><p class='article-text'><b>Validador A</b> <span class='detailSpan'>>></span> <b>Stake 32 ETH</b>  <span class='detailSpan'>>>  </span> <b>Poder de voto 1x</b> <br><br><b>Validador B</b> <span class='detailSpan'>>></span> <b>Stake 64 ETH</b>  <span class='detailSpan'>>>  </span> <b>Poder de voto 2x</b> <br><br><b>Validador C</b> <span class='detailSpan'>>></span> <b>Stake 320 ETH</b>  <span class='detailSpan'>>>  </span> <b>Poder de voto 10x</b> <br><br></p><p class='article-text'>Nesse modelo, Validadores são selecionados aleatoriamente para criar novos blocos, e com isso, receber a <a href='/academia/glossario/block-reward' target='_blank'>recompensa do bloco</a> que no atual modelo é composto somente pelas <a href='/academia/glossario/taxa-de-transacao' target='_blank'>taxas de transação</a>, já que nesse modelo, validadores não recebem novos ETH como na mineração.</p><br><br><p class='article-text'>Vale ressaltar que cada modelo <a href='/academia/glossario/proof-of-stake-pos' target='_blank'>Proof of Stake</a> possui seus próprios <a href='/academia/glossario/protocolo' target='_blank'>protocolos</a> com regras diferentes, a forma de recompensar seus validadores e a quantidade mínima para se tornar um validador não será necessariamente definitiva. Com a implementação do Ethereum Casper, esses valores poderão ser alterados.</p><br>",
        
        "<h2 class='article-header'>Problemas Ambientais da Ethereum</h2><p class='article-text'>Em redes <a href='/academia/glossario/proof-of-work-pow' target='_blank'>Proof of Work</a>, as redes são validadas através do processo de mineração, um modelo que utiliza do poder computacional dos usuários da rede para criar e validar os <a href='/academia/glossario/bloco' target='_blank'>blocos</a> de transação. Esse processo consome muitos recursos computacionais, e consequentemente eletricidade.</p><br><p class='article-text'>Com a transição para Proof of Stake, a rede não precisará dos <a href='/academia/glossario/mineradores' target='_blank'>mineradores</a> para validar os blocos, reduzindo assim os gastos de energia gerados pela mineração, tornando o Ethereum Casper uma solução para o problema ambiental da <a href='/academia/descubra/o-que-e-ethereum-eth' target='_blank'>Ethereum</a>.</p><br>",
        
        "<h2 class='article-header'>Vantagens do Ethereum Casper</h2><p class='article-text'>Ethereum Casper traz também melhorias na segurança. Por possuir um mecanismo que mapeia os blocos, validadores maliciosos poderão ser identificados rapidamente, e serão punidos por isso. </p><br><p class='article-text'>A punição por quebrar as regras é a quantidade que o validador alocou em Stake, que será subtraída do validador. Fazendo com que <a href='/academia/glossario/ataque-de-51' target='_blank'>ataques de 51%</a> e tentativas de transcrições na blockchain sejam muito caras, contudo, os desenvolvedores ainda estão trabalhando nessas possibilidades.</p><br><p class='article-text'>Outra possível vantagem da Ethereum Casper é na <a href='/academia/glossario/descentralizado' target='_blank'>descentralização</a>. Hoje o poder na rede está de certa forma concentrado naqueles que tem os recursos em hardware (como <a href='/academia/glossario/graphical-processing-unit-gpu' target='_blank'>GPUs</a> e máquinas <a href='/academia/glossario/application-specific-integrated-circuit-asic' target='_blank'>ASIC</a>) para executar operações de mineração. Com a migração para Proof of Stake auxiliar na segurança da rede é muito mais simples e pode ser feito por qualquer um que tiver a quantidade apropriada de Ether.</p><br><p class='article-text'>Por se tratar de uma atualização futura é difícil dizer com certeza se tais vantagens realmente existirão, a atualização ainda está em fase de desenvolvimento e existem muitos detalhes a serem definidos e ajustados.</p><br><section class='advertisement'></section>",
        
        "<h2 class='article-header' >Considerações Finais</h2><p class='article-text'>A Ethereum está em processo de transição para uma nova fase, onde encontrar soluções para alguns de seus problemas é essencial. Com a Ethereum 2.0 diversos mecanismos para melhorar a escalabilidade serão implementados, sendo o Ethereum Casper um deles. </p><br><p class='article-text'>A migração de <a href='/academia/glossario/proof-of-work-pow' target='_blank'>Proof of Work</a> para <a href='/academia/glossario/proof-of-stake-pos' target='_blank'>Proof of Stake</a> sempre foi um objetivo para os desenvolvedores da Ethereum, por possibilitar validações através do <a href='/academia/glossario/staking' target='_blank'>Staking</a> de ETH, usuários da rede podem trabalhar juntos para a manutenção de um ambiente seguro e descentralizado. </p><br><p class='article-text'>Outra pauta importante, é a constante luta da Ethereum com causas ambientais, o modelo de <a href='/academia/glossario/mineracao' target='_blank'>mineração</a> consome muita energia, e é extremamente agressivo ao meio ambiente. Com o Ethereum Casper esse problema encontrará uma solução.</p><br><p class='article-text'>O processo de transição da <a href='/academia/descubra/o-que-e-ethereum-eth' target='_blank'>Ethereum</a> para 2.0 iniciou-se em dezembro de 2020 com o lançamento da Beacon Chain, e desde lá diversas outras atualizações ocorreram. Porém existem muitas melhorias e ajustes a serem desenvolvidos, e não se tem como definir uma data para que a migração ocorra de forma completa.</p><br>"],
        "categories": ["blockchain", "ethereum"],
        "image": "PICLogo.png",
        "date": "25/05/2022",
        "readTime": 6,
        "mainColor": "#2563eb",
        "secondaryColor": "#dbeafe"
    }
]