[
    {
        "id": 1,
        "title": "Bitfarm vende 3000 Bitcoins como estratégia para pagar dívidas",
        "url": "bitfarm-vende-3000-bitcoins-como-estrategia-para-pagar-dividas",
        "contentTitle": "Bitfarm vende 3000 Bitcoins como estratégia para pagar dívidas",
        "content": ["<p class='article-text'> Segundo o CFO da mineradora, Jeff Lucas, \"vender 3.000 BTC de nossas reservas junto com uma parte da produção diária é a melhor estratégia tendo em vista a atual situação do mercado\".</p>",

        "<p class='article-text'>A mineradora canadense Bitfarm em um pronunciamento feito nesta terça-feira (21/06) informou ter vendido, durante os últimos 7 dias, 3.000 <a href='/academia/glossario/bitcoin' target='_blank'>bitcoins</a> de suas reservas, aproximadamente U$62 Milhões. A Bitfarm possuía cerca de 6.350 BTC em <a href='/academia/glossario/holder' target='_blank'>holding</a>, e com essa venda, sua posição diminuiu em cerca de 47%.</p>",

        "<p class='article-text'>O objetivo dessa venda é adicionar <a href='/academia/glossario/liquidez'>liquidez</a> à empresa e diminuir a alavancagem de crédito com a Galaxy Digital, empresa que financiou parte do projeto. Com isso a Bitfarms busca encontrar um equilíbrio no balanço da empresa. Dos 3000 BTC utilizados na venda, metade seriam para mitigar o crédito com a Galaxy Digital, reduzindo a dívida da Bitfarm para U$38 Milhões.</p>",

        "<p class='article-text'> Foi também mencionado pelo CFO da Bitfarm, Jeff Lucas, que a empresa deixou de seguir a estratégia de \"Holdar\" toda a produção diária, e optaram por \"tomar ações para desalavancar e aumentar a liquidez na empresa, para torná-la mais forte\". A produção diária da Bitfarm é de aproximadamente 14 BTC, e a empresa não mencionou a quantidade que passará a vender.</p>",

        "<p class='article-text'>Segundo Jeff, \"Apesar de seguirmos <a href='/academia/glossario/bullish'>bullish</a> com a apreciação do valor do Bitcoin, essa mudança estratégica nos possibilita à focar em nossas prioridades em mantermos-nos com uma operação de <a href='/academia/glossario/mineracao'>mineração</a> padrão global, e de continuar o crescimento da empresa\" Lucas disse também, que \"Vender parte de nossas reservas e produção diária para uma melhora na liquidez da empresa, é a melhor opção tendo em vista a atual situação do mercado.\"</p>",

        "<p class='article-text'>Essa movimentação pode ter sido um agravante na queda vista pelo Bitcoin e outras <a href='/academia/glossario/criptomoedas'>criptomoedas</a> ao longo dessa última semana. o mercado levou o preço do BTC abaixo de U$18.000 no sábado (18/06), preço que o Bitcoin não alcançava desde dezembro de 2020, porém se sustentou e opera, nessa terça-feira, acima de U$21.000.</p>"],
        "categories": ["blockchain", "bitcoin"],
        "image": "PICLogo.png",
        "date": "21/06/2022",
        "readTime": 5,
        "mainColor": "#2563eb",
        "secondaryColor": "#dbeafe"
    },
    {
        "id": 2,
        "title": "CryptoPunk doado para Ucrânia é vendido por U$100 Mil",
        "url": "cryptopunk-doado-para-ucrania-e-vendido-por-100-mil",
        "contentTitle": "CryptoPunk doado para Ucrânia é vendido por U$100 Mil",
        "content": ["<p class='article-text'> Em Fevereiro, a Ucrânia tornou sua carteira de <a href='/academia/glossario/criptomoedas'>criptomoedas</a> pública com o objetivo de arrecadar doações, desde então recebeu cerca de U$135 Milhões em doações relacionadas a criptomoedas.</p>",
        
        "<p class='article-text'>Dentro dessa campanha de doação o <a href='/academia/glossario/nft-tokens-nao-fungiveis'>NFT (Non-Fungible Token)</a> mais caro a ser doado foi o CryptoPunk #5364. Doado em Março, seu valor na época era aproximadamente U$255 mil dólares, porém com a queda recente do <a href='/academia/descubra/o-que-e-ethereum-eth'>Ethereum</a>, moeda utilizada no OpenSea para compra e venda de NFTs, seu valor caiu em 60%</p>",

        "<p class='article-text'>Segundo um pronunciamento feito no Twitter, Alex Bornyakov, Ministro da Transformação Digital da Ucrânia, afirmou ter vendido na segunda-feira 20/06 o CryptoPunk #5364 por 90 ETH, aproximadamente U$100 Mil, para um comprador anônimo</p>",

        "<p class='article-text'>Outra grande arrecadação feita pela Ucrânia foi também em Março com a venda pública da NFT Ukrainian Flag através da UkraineDAO, uma <a href='/academia/glossario/decentralized-autonomous-organization-dao'>DAO</a> direcionada ao apoio à Ucrânia com relação a doações em criptomoedas. A venda da NFT Ukrainian Flag somou cerca de 2250 <a href='/criptomoedas/ethereum'>ETH</a>, avaliados na época em U$6,75 Milhões</p>"],
        "categories": ["economia"],
        "image": "PICLogo.png",
        "date": "21/06/2022",
        "readTime": 3,
        "mainColor": "#2563eb",
        "secondaryColor": "#dbeafe"
    },
    {
        "id": 3,
        "title": "Inflação Americana tem sua maior alta em mais de 40 anos",
        "url": "inflaçao-americana-tem-sua-maior-alta-em-mais-de-40-anos",
        "contentTitle": "Inflação Americana tem sua maior alta em mais de 40 anos",
        "content": ["<p class='article-text'>Departamento do trabalho americano divulgou no dia 10/06 o resultado da inflação.</p>",
        
        "<p class='article-text'>O Departamento do Trabalho dos Estados Unidos (US Labor Department), divulgou na sexta-feira dia 10/06 o resultado de sua inflação anual. Segundo o departamento, o <a href='/academia/glossario/consumer-price-index-cpi'>CPI (Consumer Price Index)</a>, índice similar ao IPCA no Brasil, em maio de 2022 teve aumento de 8,6% em relação a maio de 2021, um aumento dessa escala não era visto desde dezembro de 1981.</p>",

        "<p class='article-text'>Preço da energia teve um aumento de 34,6% comparado ao ano anterior e a gasolina aumentou 49%. Outros itens básicos como o preço geral dos mercados e eletricidade subiram 11,9% e 12% respectivamente.</p>",

        "<p class='article-text'>Grande parte disso se dá devido a situação geopolítica em que os Estados Unidos está inserido, como os conflitos entre Rússia e Ucrânia, onde os Estados Unidos participaram indiretamente ao aplicar sanções contra a Rússia, e as medidas de controle da pandemia do Corona Virus tomadas pelo Federal Reserve (FED)</p>"],
        "categories": ["economia"],
        "image": "PICLogo.png",
        "date": "13/06/2022",
        "readTime": 3,
        "mainColor": "#2563eb",
        "secondaryColor": "#dbeafe"
    },
    {
        "id": 4,
        "title": "\"Morte do Bitcoin\" atinge alta histórica em número de procuras no Google",
        "url": "morte-do-bitcoin-atinge-alta-historica-em-numero-de-procuras-no-google",
        "contentTitle": "\"Morte do Bitcoin\" atinge alta histórica em número de procuras no Google",
        "content": ["<p class='article-text'>Com a queda nos preços do Bitcoin e do mercado de <a href='/academia/glossario/criptomoedas'>criptomoedas</a> em geral, as especulações sobre a \"Morte do Bitcoin\" tomaram conta das pesquisas no Google</p>",
     
        "<p class='article-text'>Segundo o Google Trends, a pesquisa por \"Bitcoin dead\", em português \"Morte do Bitcoin\", alcançou uma máxima em número de pesquisas. Google Trends é uma plataforma da Google que rastreia as pesquisas feitas na plataforma e gera relatórios sobre as buscas, sendo ranqueadas de 0 a 100. As informações de quem faz as pesquisas são anônimas mas a é possível saber o local e o tópico que se é procurado.</p>",

        "<h1 class='article-header'>Bitcoin está morto? Morte do Bitcoin? Fim do Bitcoin? </h1>",

        "<p class='article-text'>Pesquisas por esses termos atingiram o pico (100) na escala de ranqueamento do Google Trends (0-100) durante a última semana que se encerrou no dia 18/06. Segundo o próprio Google trend, esse extâse em pesquisas sobre esse tópico não ocorria desde 2017, quando o <a href='/academia/glossario/bitcoin'>Bitcoin</a> também operou em queda, e caiu cerca de <span class='txt-red'>60%</span></p>",

        "<p class='article-text'>Isso acontece devido à queda que os mercado vêm sofrendo, principalmente ao se tratar de Bitcoin e criptomoedas, que estão no vermelho por cerca de 7 meses. Por ser um ativo não tão convencional, as procuras por pessoas que não conhecem sobre o Bitcoin mostram incerteza, desconfiança e medo, tendo o índice que mede a ganância e medo, Bitcoin Fear and Greed, apontando para medo extremo </p>",

        "<p class='article-text'>Esse medo no mercado de criptomoedas está muito relacionado com a queda do protocolo <a href='/criptomoedas/terra'>Terra LUNA</a>, um dos maiores projetos do mundo cripto que praticamente morreu. Outras questões macroeconômicas também influenciaram na queda, incerteza e medo do mercado de criptomoedas, como as taxas de juros e <a href='/noticias/noticia/inflacao-americana-tem-sua-maior-alta-em-mais-de-40-anos'>inflação americana</a>, guerra da Ucrânia e Rússia, dentre outras.</p>"],
        "categories": ["blockchain"],
        "image": "PICLogo.png",
        "date": "21/06/2022",
        "readTime": 5,
        "mainColor": "#2563eb",
        "secondaryColor": "#dbeafe"
    },
    {
        "id": 5,
        "title": "Rede Optimism é atacada por exploit e perde 20M de tokens OP",
        "url": "Rede Optimism é atacada por exploit e perde 20M de tokens OP",
        "contentTitle": "Rede Optimism é atacada por exploit e perde 20M de tokens OP",
        "content": ["<p class='article-text'>A rede apesar de ter apenas 3 semanas de lançamento, alcançou grande popularidade entre a comunidade de criptomoedas. Porém após o ataque token OP já conta com uma queda de 50%.</p>",
     
        "<p class='article-text'>Optimism é uma <a href='/academia/glossario/solucoes-de-segunda-camada'>solução de segunda camada</a> para a rede da Ethereum e desde lançamento teve grande popularidade, recebendo elogios pelos usuários da rede. Entretanto o tempo de ouro da Optimism foi afetado devido ao ataque de um <a href='/academia/glossario/hacker'>Hacker</a>, divulgado pela própria Optimism no dia 08/06. </p>",

        "<p class='article-text'>Segundo a empresa, o ataque aconteceu 2 semanas antes da divulgação oficial, e foi direcionado à roubar tokens OP, o token nativo da rede Optimism, durante uma transação de 20 Milhões de tokens feita pela própria empresa.</p>",

        "<p class='article-text'>Dos 20 Milhões de tokens que foram levados pelo Hacker, 1 milhão foram vendidos no dia 05/06, cerca de U$1,3 milhão, e outros 1 milhão de tokens foram enviados para a carteira de Vitalik Buterin, Fundador da rede <a href='/academia/descubra/o-que-e-ethereum-eth'>Ethereum</a>.</p>",

        "<p class='article-text'>Na sexta feira, dia 09 de junho o Hacker devolveu 17 milhões de tokens em 17 transações de 1 milhão de tokens cada, porém o hacker segue com 1 milhão de tokens em sua posse.</p>",

        "<p class='article-text'>Apesar da devolução do atacante, o impacto da divulgação do ataque foram suficientes para derrubar o preço, que apresenta uma queda de 50% desde o dia da divulgação oficial da empresa.</p>",

        "<h2 class='article-header'>Como aconteceu o ataque?</h2>",

        "<p class='article-text'>A empresa Optimism relatou que a transação enviada seria para a plataforma <a href='/academia/glossario/decentralized-finance-defi'>DeFi</a> Wintermute que utilizaria os 20 Milhões de tokens para garantir a liquidez de seus serviços para os usuários.</p>",

        "<p class='article-text'>O erro se deu pois o <a href='/academia/glossario/smart-contracts'>Smart Contract</a> que a Wintermute utilizaria para receber os tokens estava na Layer 1, enquanto os tokens estavam na Layer 2, isso abriu uma janela de oportunidade para o hacker realizar o ataque de Exploit e enviar os tokens para uma carteira de sua escolha.</p>",

        "<p class='article-text'>Wintermute se responsabilizou pelo erro e informou a recompra das moedas que fossem vendidas pelo hacker.</p>"],
        "categories": ["blockchain"],
        "image": "PICLogo.png",
        "date": "13/06/2022",
        "readTime": 3,
        "mainColor": "#2563eb",
        "secondaryColor": "#dbeafe"
    }
]